{
  "links": [
    {
      "url": "https://levi.in/pages/shipping-terms?srsltid=AfmBOopeTBVrzcHrRIQl982QCwKxoUNaijsVpxnu6rsRFXywLiOPKrlE",
      "title": "Shipping terms – Levis India Store"
    },
    {
      "url": "https://levi.in/pages/payment-terms?srsltid=AfmBOorV0D4kxaOq5ANm0z938Mwey-LOBv4InvSljIZbeZmr6Yy9IQfO",
      "title": "Payment terms – Levis India Store"
    },
    {
      "url": "https://levi.in/pages/terms-of-use?srsltid=AfmBOoohxcxQ7eSYGsQaGXvuaWn3i1MUD0skRdMQOGi3Wvtcd2Z04SGK",
      "title": "Terms of Use – Levis India Store"
    },
    {
      "url": "https://levi.in/pages/returns?srsltid=AfmBOorK2dB9gKmjRB9dS5BaeqEatJS4wq0kDICOQPZSaNLGDZ5sSZlm",
      "title": "Returns – Levis India Store"
    },
    {
      "url": "https://levi.in/pages/track-order?srsltid=AfmBOooaPfveWZBWdAHlkQeUrBXOJrswubwLxzcF3l8haWcQTPYBghnB",
      "title": "Track Order"
    },
    {
      "url": "https://levi.in/products/mens-checke-slim-fit-shirt-a13230054?srsltid=AfmBOoqcxev0EcCPDif7iQca3wx0T2itQ7UohEEQCQsFHC51O4_lls04",
      "title": "Men's Checkered Spread Collar Linen Shirt"
    },
    {
      "url": "https://levi.in/products/womens-mid-rise-blue-solid-skirt-000uq0000?srsltid=AfmBOorttGS3IlIjCaorhmqokbuHdkbQPzZ0cpIi-Ye_eB0ODscXAVwt",
      "title": "Women's Mid Rise Blue Solid Skirt"
    },
    {
      "url": "https://levi.in/products/mens-olive-sneakers-879700015?srsltid=AfmBOor-Zz3hnrkF4UG0UaFLf93-46swTN0uGJF7DChmoI-VRA39qXje",
      "title": "Men's Solid Casual Shoes"
    },
    {
      "url": "https://levi.in/products/levis-mens-regular-fit-sweater-596380184?srsltid=AfmBOool2OruEoQa3DzqSEmyrxdgUWyf0QaFObKuj4h2lMCZ5WIDP0cT",
      "title": "Men's Printed Crew Neck Sweatshirt"
    },
    {
      "url": "https://levi.in/products/womens-brand-logo-relaxed-fit-t-shirt-871770156?srsltid=AfmBOoq1WHI1FW6T8qRR3jliTy9cInY2KF8imkqsuKRvtMQIXceKZtYj",
      "title": "Women's Brand Logo Relaxed Fit T-shirt"
    },
    {
      "url": "https://levi.in/pages/returns?srsltid=AfmBOoq6A_l7mb4zkX0kuEetQIHirujGLWbVd5B95cP1XoTYQ4Xj5x07",
      "title": "Returns – Levis India Store"
    },
    {
      "url": "https://levi.in/apps/return_prime?srsltid=AfmBOor7c_2ym9FtxMwA6-T7Zx9Ycep0-UtMfmUzkUGuHtzs0UAcqUYV",
      "title": "Returns & Exchanges"
    },
    {
      "url": "https://levi.in/products/womens-mid-rise-regular-fit-jeans-a55330001?srsltid=AfmBOoq0fcD7zg0dgKeRXvafIClg2I-sT32ZCnVtoDJ_tZjPF8OMGxRy",
      "title": "Women's High Rise Loose Fit Jeans"
    },
    {
      "url": "https://levi.in/products/levis-mens-trucker-jacket-a27940008?srsltid=AfmBOopkRmWMghL2cMOF-iGdah-D5Pgbu-CBrIjz4IBgpArwkka04MnP",
      "title": "Men's Solid Spread Collar Denim Jacket"
    },
    {
      "url": "https://levi.in/products/womens-high-rise-724-straight-fit-jeans-676670073?srsltid=AfmBOopQw_GYEc_FPhKRmNZ3QR6PlHAz0z5Zb19zrpqKIP1nIBH4d-IJ",
      "title": "Women's High Rise 724 Straight Fit Jeans"
    }
  ],
  "page_text": [
    {
      "url": "https://levi.in/pages/shipping-terms?srsltid=AfmBOopeTBVrzcHrRIQl982QCwKxoUNaijsVpxnu6rsRFXywLiOPKrlE",
      "title": "Shipping terms – Levis India Store",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nSHIPPING TERMS\nSHIPPING SERVICE & COSTS\nDELIVERY GUIDE\nRULES & RESTRICTIONS\nDELIVERY PROBLEMS\nORDER PROCESSING TIME\nSHIPPING SERVICE & COSTS\n\nWe currently only deliver to destinations in India. Subject to the shipping rules and restrictions below, delivery is currently free for all purchases for orders above Rs.999 from Levi.in. For orders under this value, a shipping charge of Rs. 100 (inclusive of all taxes) is chargeable for each order.\n\nDELIVERY GUIDE\nAllow 2 days delivery to:\n- New Delhi\n- Mumbai\n- Kolkata\n- Chennai\n- Bengaluru\n\nAllow 5 - 7 days delivery to other cities in India. For remote areas, delivery can take longer.\n\n\nDuring sale and peak periods, orders may take longer to process. Our delivery times should only be used as a guide.\n\nRULES & RESTRICTIONS\n\nOrders are processed and delivered on business days only. Business days are Monday to Saturday, excluding public holidays.\n\nCustomers will be required to sign for all deliveries. Due to logistical difficulties in making deliveries to certain remote areas, we reserve our right to cancel your order and/or make such order subject to additional terms and conditions (including, without limitation to, requiring such orders to be conditional upon a minimum value of products being ordered in a single transaction).\n\nOur Customer Care team will notify you of cancellation and/or such conditions after you place your order.\n\nDELIVERY PROBLEMS\n\nIf our shipping provider cannot make delivery to you at the provided shipping address, an additional attempt will be made the following business day. In case of a second failure to deliver, the parcel will be sent back and a refund will be initiated for all pre-paid orders.\n\nIf your parcel has been sent back, please call our Customer Care team for assistance.\n\nORDER PROCESSING TIME\n\nMost orders begin processing as soon as your online purchase is completed. Your order will be shipped once the items are located in stock. As soon as your order is shipped, you will be notified by email. Orders are typically dispatched within 24 hours on business days.\n\nPlease note that business days are Monday to Saturday, excluding public holidays. Refer to Shipping Service & Costs for a guide on delivery times.\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/pages/payment-terms?srsltid=AfmBOorV0D4kxaOq5ANm0z938Mwey-LOBv4InvSljIZbeZmr6Yy9IQfO",
      "title": "Payment terms – Levis India Store",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nPAYMENT TERMS\nPAYMENT METHODS\nCASH ON DELIVERY\nPAYMENT SECURITY\nPRICING\nPAYMENT METHODS\n\nWe currently accept India-issued debit and credit cards (Visa, MasterCard, American Express, RuPay), net banking and Cash on Delivery (COD). Unfortunately we are not able to accept orders over or payment information via phone or through mobile wallets and Card on Delivery.\n\nImportant information about payment:\nDebit and credit cards are charged once the order is placed.\nCredit or Debit cards issued outside India cannot be used to pay on Levi.in\nFor Cash on Delivery payments, we only accept valid currency notes. Card on Delivery facility is not available.\n\nPlease note that we reserve the right to contact you for further information if there is an issue with your payment.\n\nCASH ON DELIVERY\n\nYou can pay for orders placed on Levi.in using Cash on Delivery (COD) for orders up to Rs. 2,000. Only signed-in customers can pay using COD. In order to sign in or register on Levi.in, please visit https://www.levi.in/login.\n\nThere are no extra charges for COD. However, in case your order value is less than Rs. 999, standard shipping charges of Rs. 100 apply. This charge will be included as part of your invoice. Please pay only the amount printed on the invoice to the shipping partner. We accept all valid currency notes. We do not offer Card on Delivery.\n\nPAYMENT SECURITY\n\nWe take security very seriously, so your personal details will be protected. We use the industry standard encryption protocol to protect your information from unauthorised use or disclosure. All confidential data, such as payment information, is encrypted and transmitted through a secure channel using SSL encryption.\n\nShould any unauthorised charges appear on your credit/ debit card or bank account as a result of shopping with Levi.in, please notify your credit card provider or bank in accordance with its reporting rules and procedures.\n\nPlease note that Levi's® will never ask a customer to confirm any account or credit details via email, except in case of refunds for Cash on Delivery (COD) orders. If you receive an email claiming to be from Levi's® asking you to do so, do not respond and contact our Customer Care team immediately.\n\nPRICING\n\nAll prices shown are inclusive of GST and exclusive of any delivery costs. Products and prices which are offered in store might not be offered online, and vice versa. From time to time, we may offer additional discounts for purchases made online that do not apply instore, and vice versa.\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/pages/terms-of-use?srsltid=AfmBOoohxcxQ7eSYGsQaGXvuaWn3i1MUD0skRdMQOGi3Wvtcd2Z04SGK",
      "title": "Terms of Use – Levis India Store",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nTERMS OF USE\nINTRODUCTION\nELIGIBILITY\nPRIVACY POLICY & DATA SECURITY\nOWNERSHIP OF WEBSITES, CONTENT AND TRADEMARKS\nYOUR USE OF OUR WEBSITES\nUSER-GENERATED CONTENT\nUSER-GENERATED CONTENT RULES\nCOPYRIGHT AND TRADEMARK RULES\nINFRINGEMENT NOTIFICATION\nACCOUNTS, PASSWORDS AND SECURITY\nONLINE PRODUCTS AND SALES\nLINKS TO OUR WEBSITES; THIRD PARTY LINKS ON OUR WEBSITES\nCHANGE IN WEBSITES AND CONTENT\nDISCLAIMERS; LIMITATIONS ON LIABILITY; INDEMNITY\nGOVERNING LAW; SEVERABILITY; WAIVER; DISPUTE RESOLUTION; FORCE MAJEURE; ASSIGNMENT\nCONTACT US\n\nThe Terms of Use outlined below are for Levi.in. For Levi’s® Loop Member Program Terms & Conditions, please click here\n\nThese Terms of Use apply to all online visitors to the websites operated by or on behalf of Levi Strauss (India) Private Limited, having its registered office at ITC Green Centre, 5th Floor - North Tower No 18, Banaswadi Main Road, Maruthi Seva Nagar, Bangalore - 560005 (hereinafter, “we”, “us”, “our” or “ours”), including Levi.in (the \"Primary Website”) and other Indian websites which we may make available to consumers from time to time (“Other Websites”, collectively with the Primary Website, \"Websites\").\n\nOur Websites have different purposes and functionalities. We describe these differences on this page, so please read it carefully. If you have any questions regarding the Terms of Use, please contact us through the information provided towards the end of this document.\n\nWe also have a Privacy Policy that applies to our Websites, and may have other terms, legal notices and conditions applicable to various activities on our Websites, including our FAQs and terms and conditions that may apply to the purchase of goods or services and to related activities and to specific portions or features of a Website (e.g. loyalty programs, contests or promotions), all of the foregoing of which are incorporated herein by reference, and shall, together with the Terms of Use be a contractual agreement (“Terms”) between us and you.\n\nBy using, browsing, or otherwise accessing our websites, you accept and agree that you shall be contracting with us and these terms of use including the policies constitute your binding obligations with us. if you do not agree to the terms, do not use any of our websites.\n\nExcept as otherwise provided, the Terms are subject to change at any time with 7 days prior notice (for changes that are disadvantageous to the user, a 30 days' notice) and your continued use of our Websites after any changes have been implemented constitutes acceptance by you of such changes.\n\nSubject to your compliance with these Terms, we grant you a personal, non-exclusive, non-transferable, limited privilege to enter, access, and use our Websites.\n\n1. ELIGIBILITY\n\nUse of our Websites is available only to persons who can form legally binding contracts under the Indian Contract Act, 1872. Persons who are ‘incompetent to contract’ within the meaning of the Indian Contract Act, 1872 including minors are not eligible to use the Website.\n\nIf you are a minor i.e. under the age of 18 years, you should not use, access or transact on our Websites. As a minor if you wish to use or transact on our Websites, such use or transaction may be made by your legal guardian or parents.\n\n2. PRIVACY POLICY& DATA SECURITY\n\nour Privacy Policy applies to the use of all of our Websites, and its terms are made a part of the Terms by this reference.\n\nWe store and process your Information including any ‘personal information’ or ‘sensitive personal data or information’ (as defined under the Information Technology Act, 2000), if any, on computers that may be protected by physical as well as reasonable technological security measures and procedures in accordance with the Information Technology Act 2000 and Rules there under. To view our Privacy Policy, click here. If you object to your Information being transferred or used in this way please do not use our Websites.\n\nWe may disclose personal information to third parties. This disclosure may be required for us to provide you access to our Websites, to comply with our legal obligations, to enforce these Terms, to facilitate our marketing and advertising activities, or to prevent, detect, mitigate, and investigate fraudulent or illegal activities related to our Websites.\n\nWe may disclose personal information if required to do so by law or in the good faith belief that such disclosure is reasonably necessary to respond to subpoenas, court orders, or other legal process.\n\nAdditionally, by using any of our Websites, you acknowledge and agree that Internet transmissions are never completely private or secure. You understand that any message or information you send to a Website may be read or intercepted by others, even if there is a special notice that a particular transmission (for example, credit card information) is encrypted. Nonetheless, we maintain security measures in accordance with applicable data protection regulations and industry practices to protect the personal data you provide to us against accidental, unlawful or unauthorized use or disclosure.\n\n3. OWNERSHIP OF WEBSITES, CONTENT AND TRADEMARKS\n\nUnless otherwise agreed in writing, all materials on our Websites, including text, graphics, information, content, images, illustrations, designs, icons, photographs, video clips, sounds, music, artwork, computer code, software and other materials, and the copyrights, trademarks, trade names, service marks, logos, trade dress and/or other intellectual property rights in such materials (collectively, the “Content”), are owned, controlled and/or licensed by us, our associated entities or our licensors.\n\nThe Websites and Content are intended solely for personal, non-commercial use. You may download or copy the Content and other downloadable materials displayed on the Websites for your personal use only. No right, title or interest in any downloaded or copied Content is transferred to you as a result of any such downloading or copying. You shall not, either yourself or assist any person to, reproduce (except as noted above), publish, upload, transmit, encode, distribute, mirror, display, perform, alter, modify, create derivative works from, sell or exploit or otherwise use any of the Content or the Websites in connection with any public, business or commercial purpose. Any such use shall be deemed to be a violation of our intellectual property and proprietary rights. Any use for which you receive any remuneration, whether in money or otherwise, shall be considered commercial use for the purposes of this clause.\n\nCertain trademarks, trade names, service marks and logos used or displayed on our Websites are registered and unregistered trademarks, trade names and service marks of us and our associated entities. Other trademarks, trade names and service marks used or displayed on our Websites are the registered and unregistered trademarks, trade names and service marks of third parties. Nothing contained on any Website grants or should be construed as granting, by implication, estoppel, or otherwise, any license or right to you to use any such trademarks, trade names, service marks or logos displayed on such Website. Any use of such materials without our express written permission is strictly prohibited.\n\n4. YOUR USE OF OUR WEBSITES\nA) All Of Our Websites\n\nYou accept, agree and confirm that you shall use our Websites only as permitted by the Terms and only in a manner consistent with all applicable laws, rules and regulations, and generally accepted practices or guidelines in relevant jurisdictions, including any laws governing the export of data to or from your country of residence.\n\nYou agree that you shall not use any “deep-link”, “robot”, “page-scrape”, “spider”, or other automatic or manual device or process, software, program, code, algorithm or methodology, to access, acquire, copy or monitor any portion of any of our Websites or Content, or in any way reproduce or circumvent the navigational structure or presentation of any of our Websites or Content, or obtain or attempt to obtain any materials, documents or information through any means not purposely made available by us through the Websites. We reserve the right to take measures to prevent any such activity. You agree that you shall not resell use of, or access to, the Websites to any third party.\n\nYou agree that you shall not gain or attempt to gain unauthorized access to any portion or feature of any of our Websites, or any other systems or networks connected to the Websites or to any of our business partners’ servers, systems or networks, or to any of the services offered on or through our Websites, by hacking, “password-mining” or using any other illegitimate method of accessing data.\n\nYou agree that you shall not probe, scan or test the vulnerability of any of our Websites or any network connected to the Websites, nor breach the security or authentication measures on any of our Websites or any network connected to any of the Websites. You agree not to reverse look-up, trace or seek to trace any information on any other visitor to any of our Websites, or any other customer of ours, including any shopping account or members’ program account that is not held or owned by you, in any way where the purpose is to discover materials or information, including but not limited to personal information, personally identifiable information (“PII”) or other information that reasonably could be used to connect non-PII to PII.\n\nYou agree that you shall not take any action that would cause an unreasonably or disproportionately large load on the infrastructure of the Websites or our systems or networks, or any systems or networks connected to the Websites or to us in an attempt to overwhelm our systems to create a “Denial of Service” or similar attack.\n\nYou agree that you shall not use or exploit the data that is available on any of our Websites for commercial purposes, including any web scraping activities to obtain information (such as price information).\n\nYou agree that you shall not use any device, technology, software, routine or method to interfere or attempt to interfere with the proper functioning or features of any of our Websites or any transaction occurring on any of the Websites, or with any other person’s use of any of the Websites.\n\nYou agree that you shall not forge headers or otherwise manipulate identifiers in order to disguise the origin of any message or transmittal you send to us on or through any of our Websites or any service offered on or through the Websites. You must not impersonate or pretend that you are any other person or falsely claim you represent another person or entity.\n\nYou agree that you shall not use our Websites or any Content for any purpose that is unlawful or prohibited by these Terms.\n\nYou agree that you shall at all times ensure full compliance with the applicable provisions of the Information Technology Act, 2000 and Rules thereunder as applicable and as amended from time to time and also all other applicable laws, rules and regulations.\n\nBy using our Websites or sending emails or other data, information or communication to us, you agree and understand that you are communicating with us through electronic records and that you consent to receive communications via electronic records from us periodically and as and when required. We may communicate with you by email or by any other mode of communication, electronic or otherwise.\n\nYou must not do any of the following when using our Websites:\n\ncreate accounts using fake, fraudulent or otherwise false means;\ntransfer or otherwise assign login details of your account without our express prior written consent;\ninfringe a third party's intellectual property rights; and\nfail or refuse to make payment for a product ordered on our Websites.\nB) Our E-Commerce Websites\n\nSubject to Section 4(a) above, you may use our Websites (including all subsidiary websites) for the purposes of viewing or shopping for our products, and to use any other features and services purposely provided by us on those Websites.\n\nC) Our User-Generated Content Websites\n\nSubject to Section 4(a) above, you may use our user-generated content Websites (including all subsidiary websites) for the purposes of viewing or participating in online forums, uploading and downloading user-generated content, and sharing such content with other users, and to use any other features and services purposely provided by us on that Website.\n\nD) Loyalty Programs\n\nMembers of one or more of our loyalty programs must create an account with us in order to enjoy the benefits of their membership. Additional terms and conditions apply to our loyalty programs.\n\nE) Competitions\n\nFrom time to time, we may offer special promotions or competitions. Where we do offer such promotions or competitions, we will make a copy of the applicable terms available on the relevant Website.\n\n5. USER-GENERATED CONTENT\n\nWhile we appreciate your suggestions and comments on how to improve our Websites, products and services, it is our policy to not accept any creative ideas, suggestions, proposals, plans or materials other than those specifically requested by us (e.g. through a contest or promotional event). Our intent is to avoid any misunderstanding in the event that a creative endeavour we commence bears some resemblance to a creative suggestion made by a customer or visitor to our Websites. Thus, apart from personal information or PII collected on or from our Websites, which is subject to our online Privacy Policy (see Section 2 above), any material, information, suggestions, ideas, concepts, know-how, techniques, questions, comments, messages or other communication you transmit or post to any of our Websites (a “User-Generated Content”) is and will be considered non-confidential and non-proprietary.\n\nSuch User-Generated Content will become our property and you agree to grant us worldwide, perpetual and transferable rights in such User-Generated Content. We shall be entitled to, in accordance with our Privacy Policy, use the User-Generated Content or any of its elements for any type of use forever, including but not limited to promotional and advertising purposes and in any media whether now known or hereafter devised, including the creation of derivative works that may include the User-Generated Content you provide. You agree to perform all further acts necessary to perfect any of the above-mentioned rights granted by you to us, including the execution of any documents, if required by us.\n\nWe may use any User-Generated Content in our sole discretion, including for the purposes of reproduction, transmission, disclosure, publication, broadcast, development, manufacturing and we may use any User-Generated Content to develop and/or improve our services/products to consumers and send you targeted marketing messages. We shall be under no obligation (1) to maintain any User-Generated Content in confidence; (2) to pay compensation for any User-Generated Content and/or its use; or (3) to monitor, use, return, review or respond to any User-Generated Content. We will have no liability related to the content of any User-Generated Content, whether or not arising under the laws of copyright, libel, privacy, obscenity, or otherwise. We retain the right to remove any User-Generated Content that includes any material we deem inappropriate or unacceptable at our sole discretion (for example, see Sections 6 and 7 below).\n\nYou represent and warrant that any Content you submit in User-Generated Content is original to you, that you own all applicable legal rights in the Content, and that the Content does not and will not infringe upon the rights of any other person, entity or third party or contain any libellous, tortious, or otherwise unlawful information.\n\nYou represent and warrant that any individuals depicted in audio or visual files submitted as part of a User-Generated Content, including yourself, are of the age of majority in their respective states of residence. If any of the individuals depicted in any User-Generated Content are minors in their respective states of residence, you represent and warrant that you are the parent or legal custodian of each such individual and you grant the use of the media containing his/her depiction in accordance with the Terms.\n\n6. USER–GENERATED CONTENT RULES\n\nYou must comply with the rules governing User-Generated Content (\"User-Generated Content Rules\") set forth in this section 6. If you become aware of any violation of the User-Generated Content Rules or other unacceptable behavior by any user, you should report such activity to us by contacting us here.\n\nIf you post information on any of our Websites, you are solely responsible for each User-Generated Content that you post on any Websites or transmit to other users and agree that you will not hold us responsible or liable for any User-Generated Content from another user that you access on any Websites.\n\nCategories of prohibited User-Generated Content are set forth below and reflect examples but are not intended to be exhaustive of what constitutes prohibited User-Generated Content. Without limitation, you must not post or transmit to other users anything that you know or reasonably believe:\n\nis defamatory, abusive, obscene, pornographic, profane, offensive or unethical; or\ninfringes or violates another party’s intellectual property rights (such as music, videos, photos or other materials for which you do not have written authority from the owner of such materials to post on, or transmit to others through, a Website), including any party’s right of publicity or right of privacy; or\nviolates or encourages the violation of any law, statute, ordinance or regulation (including, but not limited to, criminal laws, those governing export control, consumer protection, unfair competition, anti-discrimination or false advertising) or could give rise to civil liability; or\nis threatening, harassing, unethical or that promotes racism, bigotry or hatred of any kind against any group or individual; or\npromotes or encourages violence against a person or damage or destruction of property; or\nis inaccurate, fraudulent, false or misleading in any way; or\nis illegal or promotes any illegal activities; or\npromotes illegal or unauthorized copying of another person’s copyrighted work or links to them or providing information to circumvent security measures; or\ncontains software viruses or any other computer code, files or programs designed to interrupt, destroy or limit the functionality of any computer software or hardware or telecommunications equipment or limit access to our Websites; or\ncontains any trojan horses, worms, time bombs, cancelbots, easter eggs or other computer programming routines that may damage, detrimentally interfere with, diminish value of, surreptitiously intercept or expropriate any system, data or personal information; or\ncontains or provides instructional information about illegal activities such as making or buying illegal weapons, violating someone's privacy, or providing or creating computer viruses; or\nharm minors in any way; or\ncontains any advertising, promotional materials, “junk mail,” “spam,” “chain letters,” “pyramid schemes,” or any other form of solicitation; or\ncontains material that exploits people in a sexual, violent or otherwise inappropriate manner or solicits personal information from anyone; or\nsolicits gambling or engages in any gambling activity which we, in our sole discretion, believe is or could be construed as being illegal; or\nprovides unauthorized access or exceeds the scope of authorized access to our Websites or to profiles, account information or other areas of our Websites or solicits passwords or personal identifying information for commercial or unlawful purposes from other users; or\ninterferes with another user's use and enjoyment of our Websites; or\nrefers to any website or URL that, in our sole discretion, contains material that is inappropriate for the Website or any other website, contains content that would be prohibited or violates the letter or spirit of these Terms.\n\nWhen using our Websites, you may be exposed to User-Generated Content from a variety of sources. We are not responsible for the content, accuracy, usefulness, safety, or intellectual property rights of or relating to such User-Generated Content.\n\nIt is possible that other users (including unauthorized users or \"hackers\") may post or transmit offensive or obscene materials on the Websites and that you may be involuntarily exposed to such offensive and obscene materials. It is also possible for others to obtain personal information about you due to your use of the Websites, and that the recipient may use such information to harass or injure you. We do not approve of such unauthorized uses, but by using our Websites you acknowledge and agree that we are not responsible for the use of any personal information that you publicly disclose or share with others on the Websites.\n\n7. COPYRIGHT AND TRADEMARK RULES\n\nWe are committed to complying with copyright and related laws, and we require all users of our Websites to comply with these laws. Accordingly, you must not post or store any material or content on, or disseminate any material or content over, any Websites in any manner that constitutes an infringement of third party intellectual property rights, including but not limited to, rights granted by copyright law. You must not post, modify, distribute, or reproduce in any way any copyrighted material, trademarks, or other proprietary information belonging to others without obtaining the prior written consent of the owner of such proprietary rights. It is our policy to terminate use privileges of any user who infringes the intellectual property rights of others upon receipt of proper notification to us by the intellectual property rights owner or their legal agent.\n\n8. INFRINGEMENT NOTIFICATION\n\nIf you believe that your work has been copied and posted on any of our Websites in a way that constitutes copyright infringement, please provide our designated agent (details below) with the following information:\n\nan electronic or physical signature of the person authorized to act on behalf of the owner of the copyright or other intellectual property interest;\na description of the copyrighted work or other intellectual property that you claim has been infringed;\nidentification of the material that is claimed to be infringing and a description of where the material that you claim is infringing is located on a Website;\nyour address, telephone number, and, if possible, email address;\na statement by you that you have a good faith belief that the disputed use is not authorized by the copyright or intellectual property owner, its agent, or the law; and\na statutory declaration or other statement made by declaration or under oath by you that the information contained in your report is accurate and that you are the copyright or intellectual property owner or authorized to act on the copyright or intellectual property owner’s behalf.\n\nThe foregoing information should be sent to:\n\nAttn: Legal Department\nLevis Strauss (India) Pvt. Ltd\nITC Green Centre, 5th Floor - North Tower No 18,\nBanaswadi Main Road, Maruthi Seva Nagar,\nBangalore - 560005\n\n9. ACCOUNTS, PASSWORDS AND SECURITY\n\nCertain features or services offered on or through our Websites may require you to open an account (including setting up an Account ID and password) and to share personally identifiable information (PII). Apart from the representations made in our Privacy Policy (see Section 2, above) regarding our protection of your information, you are solely and entirely responsible for maintaining the confidentiality of your account information, including your Account ID and password, and for any and all activity that occurs on or under your account. If any of the information provided to us as part of the account opening or registration process changes, you must promptly change your account details online.\n\nYou must notify us immediately of any actual or potential unauthorized use of your account or password, or any other actual or potential breach of security. However, you are solely liable for the actions of, and any losses incurred by us or any third party due to, someone else using your Account ID, password or account.\n\nYou must not use anyone else’s Account ID, password or account at any time without the express permission and consent of the holder of that Account ID, password or account. We cannot and will not be liable for any loss or damage arising from your failure to comply with these obligations.\n\n10. ONLINE PRODUCTS AND SALES\nA) Your Account\n\nYou do not need to have an account to place an order on our Primary Website. However, if you have an account on our Primary Website, you may enjoy a better shopping experience through the benefits an account offers, such as being able to view your purchase history and save your contact and shipping information.\n\nB) Ordering Of Products\n\nYou may purchase products by selecting and submitting an order on our Primary Website in accordance with these Terms.\n\nAny order that we receive from you in relation to a product on our Primary Website is treated as an offer by you (either to us, or the third party provider, as the case may be). It is an offer made by you to purchase the product for the price listed (inclusive of any fees and charges). The offer is made at the time that the order is made, and on these Terms.\n\nIn order to process any orders, we may require additional information from you. Where we do request such information, you must provide accurate, complete and up to date information so that we can confirm the details of the order.\n\nWe reserve the right, without prior notice, to limit the order quantity on any product or service and/or to refuse service to any customer.\n\nYou confirm that the product(s) ordered by you are being purchased for your internal / personal purpose and not for re-sale or business purposes. You authorize us to declare and provide declaration to any governmental authority on your behalf stating the aforesaid purpose of the product(s) ordered by you on our Primary Website.\n\nC) Acceptance Of An Order\n\nAcceptance of the order occurs where:\n\nwe confirm that the product(s) you have ordered are available for delivery;\nthe payment made by you for the product(s) is approved by us and we have debited the amount of the order from your debit or credit card or other payment method (i.e. when the payment is cleared); and\nwe send an email to you with your invoice and tracking information.\n\nIf, for whatever reason, we decide to reject the order placed by you, we will endeavour to inform you of this within a reasonable period after the order is submitted.\n\nD) Pricing And Availability\n\nWe try to ensure that the information provided on our Websites is accurate, up to date and error-free. In relation to our Primary Website, this includes pricing information in relation to our products.\n\nHowever, where the price listed does contain any errors or inaccuracies, we will endeavour to inform you of this as soon as practicable, but before we accept your order. If we are able to make contact with you, we will provide you with the option of reconfirming the order at the correct price, or cancelling the order. If we are unable to make contact with you within a reasonable period of time following receipt of the order, we will treat the order as being cancelled.\n\nWhere an error or inaccuracy results in the receipt of an order for a product that is out of stock or not available, we reserve the right to refuse to fill any such orders and contact you as soon as practicable with the option of selecting an alternative product through the Primary Website.\n\nPrices, promotions and products offered on our Primary Website may be site specific.\n\nE) Fees, Charges And Taxes\n\nAll prices listed are in Indian Rupees (INR).\n\nThe prices listed on our Primary Website are, where applicable, inclusive of VAT/CST, service tax, Goods and Services Tax (GST), duties and cesses (as applicable) unless stated otherwise. If any additional charges or fees apply (such as delivery fees, duties and cesses, etc.), these will be clearly disclosed at the beginning of the online purchasing process.\n\nF) Delivery Of Products\n\nWhen you place an order on our Primary Website, we (through our third party delivery provider) will deliver your order to the address designated by you as long as that address is within India and compliant with the restrictions set out on the Primary Website. We may require verification of information prior to the acceptance and/or delivery of any order.\n\nWe may not charge for the first delivery attempt, but minimum purchase amounts may apply in some circumstances (including without limitation where your delivery address is remote or difficult to access). You may be required to pay for the delivery charges after the first unsuccessful delivery attempt, if any.\n\nDelivery times are indicative only and are based on estimates indicated by our delivery providers and the typical delivery times experienced by us. At certain times, delivery times may be longer than what is advised (such as in busy periods, including sale and holiday seasons).\n\nWe will only make delivery of a product where we are able to deliver it to a person who can sign for it at the delivery address, or where we have received your express authorisation to leave a product at the delivery address. Where you have provided such an authorisation, you accept the risk of theft, damage or loss of the product from the time and location at which it is delivered.\n\nWhere we cannot deliver the product to a person who can sign for it, and do not have an express authorisation to leave the product at the delivery location, we will leave the product at the post office from where you must collect it within 7 days, after which the product will be returned to us. You may contact our customer care to arrange another time for delivery. If you do not contact our customer care within 7 days, we will cancel your order and refund your money.\n\nSee our shipping FAQs for information about shipping.\n\nG) Amending And Cancellation Of Orders\n\nOnce an order has been placed, it cannot be amended or cancelled by you. This includes amending details such as the delivery address, removal of items or colour/size changes. We therefore ask that, at the time when the order is made, you ensure that the details provided are accurate, complete and up to date. You may, however, return your order once it has been delivered to you. Please note that any shipping charges that may have been applied on your order will not refunded, except in case of damaged products received.\n\nWe may, however, cancel an order for any of the reasons outlined in these Terms, where the order has been placed in contravention of these Terms, the product has been recalled, or where required by law.\n\nH) Returns\n\nUnless otherwise specifically provided in writing, we will only refund or accept changes in accordance with these Terms and our FAQs. We will accept returns within 60 days from the order confirmation date, provided they are still in their original condition (unused and with the original tags still attached). Please see our returns FAQs for information about returns. We do not exchange goods, other than where required by law. We do not accept returns for final sales, promotional items or opened-packaged items.\n\nWe will accept returns and provide you with a refund where:\n\nthe products are faulty or not of acceptable quality;\nthe products do not match the sample of our description; and\nthe products are not fit for their intended purpose.\n\nAll refunds will be provided in Indian Rupees using your original payment method. For cash on delivery orders, the refund will be provided through online transfer only. We will not be able to issue a cheque or pay through cash.\n\nReturn shipping fees are non-refundable. However, if the product is faulty or not of acceptable quality, does not match the sample of our description or is not fit for its intended purpose, we will reimburse the return shipping fees.\n\nI) Payment Methods\n\nWe accept payment (through our third party merchants) through any of the payment methods specified in our Payment Terms\n\nWe will provide you with an invoice following the making of any payment.\n\nWhile availing any of the payment methods available on our Primary Website, we will not be responsible or assume any liability, whatsoever in respect of any loss or damage arising directly or indirectly to you due to lack of authorization for any transactions, or exceeding the preset limit mutually agreed by you and your bank, or any payment issues arising out of the transaction, or decline of transaction for any other reasons.\n\nJ) Product Descriptions\n\nAlthough we endeavour to ensure that the information provided on our Websites is as accurate as possible, we do not warrant that the product descriptions or other Content of our Websites is accurate, complete, reliable, current, or error-free. We therefore assume no liability in this regard.\n\nWe reserve the right to correct any typographical errors, inaccuracies, or omissions that may relate to product descriptions, pricing and availability from time to time without prior notice. If a product offered on our Primary Website is not as described, your sole remedy is to return it to us in accordance with our Return Policy.\n\nK) Colours And Representations\n\nWe have made every effort to display as accurately as possible the colours of our products that appear at our Websites. We cannot guarantee that your electronic devices’ display of any colour will be accurate, complete, reliable or error-free.\n\nL) Risk Of Loss\n\nThe risk of loss or damage for all products purchased passes to you upon delivery of the products to your designated delivery address. In the event that you return your purchased product, you are responsible for the risk of such product until we receive it at our warehouse. This means that you are responsible for filing any claims with the carrier for the damaged and/or lost shipments in case of returns.\n\nM) FAQs\n\nOur FAQs also includes provisions that relate to how we supply our products to you. To the extent that there is any inconsistency between the FAQs and these Terms of Use, the provisions in these Terms of Use will apply.\n\n11. LINKS TO OUR WEBSITES; THIRD PARTY LINKS ON OUR WEBSITES\n\nCreating or maintaining any link from another website to any page on any of our Websites without our prior written permission is prohibited. Running or displaying any of our Websites or any information or material displayed on any Website in frames or through similar means on another website without our prior written permission is prohibited. Any permitted links to any of our Websites must comply will all applicable laws, statutes, rules and regulations.\n\nFrom time to time, a Website may contain links to other websites that are not owned, operated or controlled by us. All such links are provided solely as a convenience to you. If you use these links, you will leave our Websites and we cannot be responsible for any content, materials, information or events that are present on or that occur on websites that are not owned, operated or controlled by us.\n\n12. CHANGE IN WEBSITES AND CONTENT\n\nWe reserve the right, in our sole discretion, to: modify, suspend or discontinue any of our Websites or any service, Content, feature or product offered through any Website, with or without notice; charge fees in connection with the use of any Website; modify and/or waive any fees charged in connection with any Website; and/or offer opportunities to some or all users of any Website. You agree that we shall not be liable to you or to any third party should any of the foregoing occur with respect to any of our Websites.\n\n13. DISCLAIMERS; LIMITATIONS ON LIABILITY; INDEMNITY\n\nYour use of this Website is at your own risk. The Content and services provided on our Websites are provided “as is” without any representations or warranties of any kind including warranties of merchantability, fitness for a particular purpose, or non-infringement of intellectual property.\n\nWithout prejudice to the forgoing, we do not warrant that:\n\nA) Our Websites Will Be Constantly Available, Or Available At All; Or\nB) The Information On Our Websites Is Complete, True, Accurate Or Non-Misleading.\n\nWe will not be liable to you in any way or in relation to the Contents or services of, or use of, or otherwise in connection with, the Websites. We do not warrant that our Websites; information, Content, materials, product (including software) or services included on or otherwise made available to you through our Websites; their servers; or electronic communication sent from us are free of viruses or other harmful components. We do not assume any responsibility for any damages to, or any viruses that may infect, your computer, telecommunication equipment, or other property caused by or arising from your access to, use of, or browsing any of our Websites, or your downloading of any information or materials from any of our Websites;\n\nNothing on our Websites constitutes, or is meant to constitute, advice of any kind.\n\nIn no event will we or any of our respective officers, directors, employees, shareholders, associated entities, agents, successors or assigns, nor any party involved in the creation, production or transmission of this Website, be liable to you or anyone else for any indirect, special, punitive, incidental or consequential damages (including, without limitation, those resulting from lost profits, lost data or business interruption) arising out of the use, inability to use, or the results of use of our Websites, any websites linked to our Websites, or the materials, information or services contained on any or all such websites, whether based on warranty, contract, tort or any other legal theory and whether or not advised of the possibility of such damages.\n\nIf any part of these warranty disclaimers or limitations of liability is found to be invalid or unenforceable for any reason or if we are otherwise found to be liable to you in any manner, then our aggregate liability for all claims under such circumstances for liabilities or damages, shall not exceed the amount you paid to purchase the product related to your claim of damages.\n\nTo the extent that you cause or contribute to any loss or damage suffered, our liability to you for any such loss or damage shall be reduced to that extent.\n\nYou agree to defend, indemnify and hold us and our associated entities harmless, and our officers, directors, employees, business partners and agents, from and against any and all claims, demands, actions, damages, obligations, losses, liabilities, costs or debt, and expenses (including but not limited to reasonable attorneys’ fees) arising from:\n\n(i) any breach by you of any of these Terms, including but not limited to the Terms of Use, our Privacy Policy or any other Policies governing the use of our Websites; or\n\n(ii) your violation of any applicable law, rules or regulations or any agreement or terms with a third party to which you are subject to; or\n\nc) your User-Generated Content; or\n\nd) your use of materials or features available on our Websites.\n\n14. GOVERNING LAW; SEVERABILITY; WAIVER; DISPUTE RESOLUTION; FORCE MAJEURE; ASSIGNMENT\n\nIt is your responsibility to ascertain and obey all applicable local, state, and international laws, statutes, rules and regulations (including minimum age requirements) related to the use of our Websites. Any dispute arising out of, or relating to, the use of any of Our Websites will be governed by and construed in accordance with the laws of India. You agree, as we do, to submit to the exclusive jurisdiction of the courts at Bangalore, India.\n\nIf any part of the Terms shall be held or declared to be invalid or unenforceable for any reason by any court of competent jurisdiction, such provision shall be ineffective but shall not affect any other part of the Terms.\n\nAny failure by us to partially or fully exercise any rights or the waiver of any breach of the Terms by you, shall not prevent a subsequent exercise of such right by us or be deemed a waiver by us of any subsequent breach by you of the same or any other term of the Terms. Our rights and remedies under the Terms shall be cumulative, and the exercise of any such right or remedy shall not limit our right to exercise any other right or remedy.\n\nAny claim arising out of, or relating to, the Terms must be brought within one year after the cause of action arises, or such claim or cause of action is barred. You shall not seek recovery or damages other than for the amount you paid to purchase the product related to your claim. In the event of any controversy or dispute between us and you arising out of or in connection with your use of our Websites, the parties shall attempt, promptly and in good faith, to resolve any such dispute. If we are unable to resolve any such dispute within a reasonable time (not to exceed 30 days), then either party may submit such controversy or dispute to mediation. If the dispute cannot be resolved through mediation, then the parties shall be free to pursue any right or remedy available to them under applicable law in the courts at Bangalore, India.\n\nA party shall not breach these Terms and is not liable to the other party for a delay or failure to perform an obligation resulting from events or circumstances beyond a party’s reasonable control, including acts of God, war, flood, fire, storm, explosion, civil disobedience, tempest, theft, vandalism, riots, terrorist actions, wars, interruption to telecommunications systems, network failure or the act or omission of any third party (other than contractors or subcontractors) over which the party has no control, but does not include an obligation to pay monies.\n\nYou may not assign or delegate or otherwise deal with all or any of your rights or obligations under these Terms. We have the right to assign or otherwise delegate all or any of our rights or obligations under these Terms to any person.\n\n15. CONTACT US\n\nIf you have any questions or concerns about the Terms, please contact us by any of the methods:\n\nBy phone: 1800-123-5384\nBy email: customercare@levi.in\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/pages/returns?srsltid=AfmBOorK2dB9gKmjRB9dS5BaeqEatJS4wq0kDICOQPZSaNLGDZ5sSZlm",
      "title": "Returns – Levis India Store",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nRETURNS\nRETURN POLICY\nREFUNDS\nITEM DAMAGED DURING SHIPMENT\nEXCHANGE\nIN-STORE RETURNS AND EXCHANGE\nFAQS\nRETURN POLICY\n\nReturning an item is easy. If you're not satisfied with your purchase, you can initiate a return online. Please note that items must be returned within 15 days of the order confirmation date and that items are in their original condition, where the item is unworn, unwashed, without alterations and has all tags attached. Levi.in reserves the right to deny refund if the item does not meet its Return Policy guidelines. Final sales, promotional items or opened packaged items may not be exchanged, returned or refunded. \n\nReturns are not available on the orders placed using the promo NORETURN and BUY2GET2. Only size exchanges are allowed.\n\nWe guarantee our merchandise to be free of manufacturing defects. If you receive a damaged or defective item, or your item proves to be defective in workmanship or materials within 15 days with normal wear (excluding stains), we will always accept the item for assessment and provide a refund if validated as faulty. Such returns have to be initiated with our customer care and not via online returns.\n\nIf you miss your return pickup, one more attempt will be made to pick up your return package on the following business day. After the second failed attempt, the return request will be cancelled.\n\nAs soon as we receive your return in our warehouse, we will proceed with the returns check and validation. Once the return has been approved, we will notify you by email and your refund will be credited within 15 days. If you return is not approved, a member of our Customer Care team will be in touch.\n\nPlease do not hand over any additional items to the shipping partner during return pickup. If you wish to return more products, please get in touch with our Customer Care team, who will arrange a pickup for the additional products. We will not be responsible for refund of additional/ unaccounted products lost in transit.\n\nREFUNDS\n\nRefunds will be made to the same form of payment originally used for the purchase within 15 days. Please note that refund payment times are dictated by the issuing bank and are outside our control. Please consult your bank for more information.\n\nFor Cash on Delivery (COD) orders ref, nds will be issued through bank/UPI transfers only. Please add correct details while placing your online return request. In case of failure, you will receive a link, using which you can initiate refund on your preferred mode.\n\nPlease note that we are unable to issue refunds through cash or cheque.\n\nIf an item is returned that does not comply with our Returns Policy, we will not approve and process the refund. We reserve the right to not return an item which does not comply with our Returns Policy. Please contact our Customer Care team to enquire about the validity of your return if you are unsure.\n\nITEM DAMAGED DURING SHIPMENT\n\nIf you received an item which is damaged upon arrival, please contact our Customer Care team immediately. You have the right to a full refund on all shipments that arrive damaged provided you inform us within 1 week of receiving the package.\n\nTo return an item, please follow the Return Instructions. Once the item is received we will assess and validate. If approved, we will refund the purchase price of the damaged item.\n\nEXCHANGE\n\nYou can exchange your order once within 15 days of order confirmation date. Please note that items should be in their original condition, where the item is unworn, unwashed, without alterations and has all tags attached. Levi.in reserves the right to deny to reject if the item does not meet its Policy guidelines.\n\nItems bought on sale will only be valid for exchange.  \n\nWARRANTY\n\nAt Levi's, we stand behind the quality of our products and want you to love every purchase. A 6-Months warranty backs all Levi's India products against manufacturing and material defects (excluding normal wear and tear). \n\nExamples of Manufacturer Defects: A manufacturer defect is any irregularity or flaw that goes beyond normal wear and tear. Here are some examples:\n\nStitching Issues: Uneven or frayed stitching affecting structural integrity.\nFaulty Zippers or Buttons: Malfunctioning closures hindering normal use.\nMisalignment of Pockets: Uneven or misaligned pocket sewing.\nIssues with Hardware: Problems with rivets, grommets, or metal components.\n\nUnderstanding Jeans Warranty: Small Holes and Wear & Tear\n\nIt's essential to clarify what's covered under our warranty when it comes to small holes that appear over time.\n\nOur warranty is designed to protect against manufacturing defects, such as issues with stitching or material quality. However, normal wear and tear—like small holes from regular use—isn't typically covered under warranty.\n\nHere are more examples of wear and tear that are considered normal with regular use of jeans:\n\nFading: Over time, jeans naturally fade due to washing and exposure to sunlight.\nStretching: Fabric can stretch with regular wear, especially in areas like the knees and seat.\nAbrasion: Friction from everyday use can cause slight abrasion on fabric surfaces.\nMinor Pilling: Small balls of fibers may form on the fabric surface, particularly in high-friction areas.\nColor Transfer: Some dye from jeans may transfer onto other fabrics, especially when new.\nHem Wear: The bottom edge of jeans may show signs of wear or fraying over time.\nBelt Loops: Belt loops can wear down with frequent belt use.\n\nHow to Initiate a Warranty Claim:\n\nSend an email to customercare@levi.in. Attach pictures of the defect, size label, country label, and product style label.\nYou will receive an email confirmation when a claim has been received.\nWait 3-4 business days for processing.\n\nWarranty Program Details:\n\nIf we confirm a defect, we'll send you a voucher for a replacement at Levi.in. It's important to keep in mind that the voucher is for one-time use only. Any funds not utilized towards the purchase of your replacement garment are non-refundable.\nNote: The voucher will not be replaced if you return or exchange the replacement garment for any reason.\nLost or stolen vouchers won't be replaced.\nOne product per claim, up to six claims every six months. Claims exceeding the limit won't be accepted. LS&CO reserves the right to modify or terminate this policy at any time without notice. Final decisions can't be re-inspected.\n\nPhoto Instructions:\n\nSend at least two clear images of the defect, the size label, and the product care label.\nImages must be sharp and clear, and numbers on the size tag must be legible.\n\nPhoto Examples:\n\n\n\n\n \n\nWe hope this guide makes your warranty claim process easy. Remember proper care ensures your jeans stay in top condition.\n\nIN-STORE RETURNS AND EXCHANGE\n\nProducts bought on Levi.in cannot be returned or exchanged at our retail stores. Please follow our online return process. Similarly products bought online cannot be returned/exchanged in our retail stores.\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/pages/track-order?srsltid=AfmBOooaPfveWZBWdAHlkQeUrBXOJrswubwLxzcF3l8haWcQTPYBghnB",
      "title": "Track Order",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\n\nTRACK ORDER\n\nSubmit\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/products/mens-checke-slim-fit-shirt-a13230054?srsltid=AfmBOoqcxev0EcCPDif7iQca3wx0T2itQ7UohEEQCQsFHC51O4_lls04",
      "title": "Men's Checkered Spread Collar Linen Shirt",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nHome \n\nMen's Checkered Spr...\n\nSkip to product information\nMEN'S CHECKERED SPREAD COLLAR LINEN SHIRT\nNo rating value Same page link.\n \n(0)\nWrite a review\nRegular price\n₹3,399.00\nSale price\n₹1,496.00\n55% OFF\n\nInclusive of all taxes\n\nExtra 15% Off on Rs. 3499\n\nColor:\n\nBlack\n\nVariant sold out or unavailable\n\nSize\n\nSIZE CHART\nS\nVariant sold out or unavailable\nM\nVariant sold out or unavailable\nL\nVariant sold out or unavailable\nXL\nVariant sold out or unavailable\nXXL\nVariant sold out or unavailable\n\nSelect Quantity:\n\nDecrease quantity for Men&#39;s Checkered Spread Collar Linen Shirt\nIncrease quantity for Men&#39;s Checkered Spread Collar Linen Shirt\n\nQTY Limit Reached!\n\nDelivery Eligibility\n\nEnter Pincode\n\nCheck\nSold out\nBUY NOW\n15 Days Returns\nCash on Delivery\nPriority Delivery\n\nDescription\n\nFit and Sizing\n\nComposition and Care\n\nAdditional Details\n\n  \nREVIEWS\nReview this Product\nSelect to rate the item with 1 star. This action will open submission form.\nSelect to rate the item with 2 stars. This action will open submission form.\nSelect to rate the item with 3 stars. This action will open submission form.\nSelect to rate the item with 4 stars. This action will open submission form.\nSelect to rate the item with 5 stars. This action will open submission form.\nBe the first to review this product\n\nYOU MAY ALSO LIKE\n\n46% OFF\n\nMen's Checkered Spread Collar Shirt\n\n₹1,727\n\n₹3,199\n\n46% OFF\n\nMen's Checkered Spread Collar Shirt\n\n₹1,727\n\n₹3,199\n\n46% OFF\n\nMen's Checkered Spread Collar Shirt\n\n₹1,727\n\n₹3,199\n\n46% OFF\n\nMen's Checkered Spread Collar Shirt\n\n₹2,159\n\n₹3,999\n\n46% OFF\n\nMen's Checkered Spread Collar Shirt\n\n₹1,727\n\n₹3,199\n\n50% OFF\n\nMen's Checkered Slim Fit Linen Shirt\n\n₹1,599\n\n₹3,199\n\n46% OFF\n\nMen's Checkered Spread Collar Shirt\n\n₹1,943\n\n₹3,599\n\n46% OFF\n\nMen's Checkered Spread Collar Shirt\n\n₹2,051\n\n₹3,799\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/products/womens-mid-rise-blue-solid-skirt-000uq0000?srsltid=AfmBOorttGS3IlIjCaorhmqokbuHdkbQPzZ0cpIi-Ye_eB0ODscXAVwt",
      "title": "Women's Mid Rise Blue Solid Skirt",
      "content": "Error extracting content: Expecting value: line 1 column 1 (char 0)"
    },
    {
      "url": "https://levi.in/products/mens-olive-sneakers-879700015?srsltid=AfmBOor-Zz3hnrkF4UG0UaFLf93-46swTN0uGJF7DChmoI-VRA39qXje",
      "title": "Men's Solid Casual Shoes",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nHome \n\nMen's Solid Casual ...\n\nSkip to product information\nMEN'S SOLID CASUAL SHOES\n3.3 out of 5 stars, average rating value. Read 4 Reviews. Same page link.\n3.3\n \n(4)\nWrite a review\nRegular price\n₹3,999.00\nSale price\n₹2,160.00\n45% OFF\n\nInclusive of all taxes\n\nExtra 15% Off on Rs. 3499\n\nColor:\n\nOlive Green\n\nVariant sold out or unavailable\n\nSize\n\nSIZE CHART\n7\nVariant sold out or unavailable\n10\nVariant sold out or unavailable\n11\nVariant sold out or unavailable\n12\nVariant sold out or unavailable\n\nSelect Quantity:\n\nDecrease quantity for Men&#39;s Solid Casual Shoes\nIncrease quantity for Men&#39;s Solid Casual Shoes\n\nQTY Limit Reached!\n\nDelivery Eligibility\n\nEnter Pincode\n\nCheck\nSold out\nBUY NOW\n15 Days Returns\nCash on Delivery\nPriority Delivery\n\nDescription\n\nFit and Sizing\n\nComposition and Care\n\nAdditional Details\n\n  \nREVIEWS\nRating Snapshot\nSelect a row below to filter reviews.\n5 stars\nstars\n\t\n\t1\n1 review with 5 stars.\n\n4 stars\nstars\n\t\n\t1\n1 review with 4 stars.\n\n3 stars\nstars\n\t\n\t1\n1 review with 3 stars.\n\n2 stars\nstars\n\t\n\t0\n0 reviews with 2 stars.\n\n1 star\nstars\n\t\n\t1\n1 review with 1 star.\nRate Product\n3.3\n4 Reviews\nReview this Product\nSelect to rate the item with 1 star. This action will open submission form.\nSelect to rate the item with 2 stars. This action will open submission form.\nSelect to rate the item with 3 stars. This action will open submission form.\nSelect to rate the item with 4 stars. This action will open submission form.\nSelect to rate the item with 5 stars. This action will open submission form.\nAdding a review will require a valid email for verification\nFilter Reviews\nSearch topics and reviews search region\nRating\nLocale\n1 to 3 of 4 Reviews\n1 – 3 of 4 Reviews\nRegional reviews\nDisplay a popup with information about Regional Sort.\nSort by\nRegional\nREGIONAL REVIEWS\n0 Regional Reviews. Select a star rating to review the product\nGLOBAL REVIEWS\n3 out of 5 stars.\nOk OK Item\nSuzzy\na year ago\nSole of the shoe is very thin and the and does not give the kushan as expected from levi's brand..!\nQ: Size Purchased\nA: 9\nQ: What size do you usually wear?\nA: 9\nHelpful?\n(0)\n(0)\nReport\nResponse from Levi’s®:\na year ago\nLevi's Customer Support\nHey there,\nWe're sorry to hear that your experience with our product didn't meet your expectations. At Levi's, we strive to deliver high-quality products that our customers love, and we're sorry that we fell short this time.\nSo you know, we have a 60-day exchange policy where you can exchange your item(s) for a different size, free of charge**. Please visit our Help Center for more information if you have any more questions. Free shipping and Returns for Red TabTM Members. Sign up Here or check and see if you’re already a Member.\n5 out of 5 stars.\nVery Comfortable\nRahul Radhakrishnan\na year ago\nSuper quality, weightless and premium looking shoes\nQ: Size Purchased\nA: 9\nQ: What size do you usually wear?\nA: 9\nHelpful?\n(0)\n(0)\nReport\n4 out of 5 stars.\nNice Speakers For The Price Of 1200\nArsh\na year ago\nThe sneakers are mostly comfortable and nice to wear. They look awesome, but they start to look really dull if you walk on dusty roads.\nQ: Size Purchased\nA: 9\nQ: What size do you usually wear?\nA: 8\nHelpful?\n(0)\n(0)\nReport\n1 Ratings-Only Review\n\nYOU MAY ALSO LIKE\n\n50% OFF\n\nMen's White Casual Shoes\n\n₹2,299\n\n₹4,599\n\n50% OFF\n\nMen's Street Black Casual Shoes\n\n₹1,799\n\n₹3,599\n\n50% OFF\n\nMen's Red Casual Shoes\n\n₹1,999\n\n₹3,999\n\n50% OFF\n\nMen's Beige Casual Shoes\n\n₹1,999\n\n₹3,999\n\n45% OFF\n\nMen's Solid Padded Jacket\n\n₹2,484\n\n₹4,599\n\n50% OFF\n\nMen's Street Navy Casual Shoes\n\n₹1,799\n\n₹3,599\n\n50% OFF\n\nMen's Brown Casual Shoes\n\n₹1,499\n\n₹2,999\n\n50% OFF\n\nMen's Sculpt Black Casual Shoes\n\n₹2,299\n\n₹4,599\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/products/levis-mens-regular-fit-sweater-596380184?srsltid=AfmBOool2OruEoQa3DzqSEmyrxdgUWyf0QaFObKuj4h2lMCZ5WIDP0cT",
      "title": "Men's Printed Crew Neck Sweatshirt",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nHome \n\nMen's Printed Crew ...\n\nSkip to product information\nMEN'S PRINTED CREW NECK SWEATSHIRT\nNo rating value Same page link.\n \n(0)\nWrite a review\nRegular price\n₹3,299.00\nSale price\n₹1,782.00\n45% OFF\n\nInclusive of all taxes\n\nExtra 15% Off on Rs. 3499\n\nColor:\n\nYellow\n\nVariant sold out or unavailable\n\nSize\n\nSIZE CHART\nS\nVariant sold out or unavailable\nM\nVariant sold out or unavailable\nL\nVariant sold out or unavailable\nXL\nVariant sold out or unavailable\nXXL\nVariant sold out or unavailable\n\nSelect Quantity:\n\nDecrease quantity for Men&#39;s Printed Crew Neck Sweatshirt\nIncrease quantity for Men&#39;s Printed Crew Neck Sweatshirt\n\nQTY Limit Reached!\n\nDelivery Eligibility\n\nEnter Pincode\n\nCheck\nSold out\nBUY NOW\n15 Days Returns\nCash on Delivery\nPriority Delivery\n\nDescription\n\nFit and Sizing\n\nComposition and Care\n\nAdditional Details\n\n  \nREVIEWS\nReview this Product\nSelect to rate the item with 1 star. This action will open submission form.\nSelect to rate the item with 2 stars. This action will open submission form.\nSelect to rate the item with 3 stars. This action will open submission form.\nSelect to rate the item with 4 stars. This action will open submission form.\nSelect to rate the item with 5 stars. This action will open submission form.\nBe the first to review this product\n\nYOU MAY ALSO LIKE\n\n55% OFF\n\nMen's Graphic Print Crew Neck Sweatshirt\n\n₹1,188\n\n₹2,699\n\n45% OFF\n\nMen's Abstract Print Crew Neck Sweater\n\n₹2,376\n\n₹4,399\n\n55% OFF\n\nMen's Printed Crew Neck Sweater\n\n₹1,320\n\n₹2,999\n\n64% OFF\n\nMen's Graphic Print Crew Neck Sweatshirt\n\n₹945\n\n₹2,699\n\n64% OFF\n\nMen's Printed Crew Neck Sweatshirt\n\n₹875\n\n₹2,499\n\n45% OFF\n\nMen's Brand Logo Crew Neck Sweatshirt\n\n₹1,350\n\n₹2,499\n\n64% OFF\n\nMen's Brand Logo Crew Neck Sweatshirt\n\n₹945\n\n₹2,699\n\n55% OFF\n\nMen's Brand Logo Crew Neck Sweater\n\n₹1,320\n\n₹2,999\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/products/womens-brand-logo-relaxed-fit-t-shirt-871770156?srsltid=AfmBOoq1WHI1FW6T8qRR3jliTy9cInY2KF8imkqsuKRvtMQIXceKZtYj",
      "title": "Women's Brand Logo Relaxed Fit T-shirt",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nHome \n\nWomen's Brand Logo ...\n\nSkip to product information\nWOMEN'S BRAND LOGO RELAXED FIT T-SHIRT\nNo rating value Same page link.\n \n(0)\nWrite a review\nRegular price\n₹999.00\nSale price\n₹799.00\n20% OFF\n\nInclusive of all taxes\n\nExclusive offers on new season\n\nExtra 15% Off on Rs. 3499\n\nColor:\n\nBlue\n\nSize\n\nSIZE CHART\nXS\nVariant sold out or unavailable\nS\nVariant sold out or unavailable\nM\nVariant sold out or unavailable\nL\nVariant sold out or unavailable\nXL\nVariant sold out or unavailable\n\nSelect Quantity:\n\nDecrease quantity for Women&#39;s Brand Logo Relaxed Fit T-shirt\nIncrease quantity for Women&#39;s Brand Logo Relaxed Fit T-shirt\n\nQTY Limit Reached!\n\nDelivery Eligibility\n\nEnter Pincode\n\nCheck\nSold out\nBUY NOW\n15 Days Returns\nCash on Delivery\nPriority Delivery\n\nDescription\n\nFit and Sizing\n\nComposition and Care\n\nAdditional Details\n\n  \nREVIEWS\nReview this Product\nSelect to rate the item with 1 star. This action will open submission form.\nSelect to rate the item with 2 stars. This action will open submission form.\nSelect to rate the item with 3 stars. This action will open submission form.\nSelect to rate the item with 4 stars. This action will open submission form.\nSelect to rate the item with 5 stars. This action will open submission form.\nBe the first to review this product\n\nYOU MAY ALSO LIKE\n\nWomen's Mid Rise 711 Skinny Fit Jeans\n\n₹2,999\n\nNEW!\n\nWomen's Brand Logo Relaxed Fit T-Shirt\n\n₹1,599\n\n₹1,999\n\nNEW!\n\nWomen's Solid Yellow Scoop Neck Top\n\n₹1,039\n\n₹1,299\n\n45% OFF\n\nWomen's Brand Logo Relaxed Fit T-Shirt\n\n₹549\n\n₹999\n\n40% OFF\n\nWomen's High Rise 726 Flared Fit Blue Jeans\n\n₹2,879\n\n₹4,799\n\nNEW!\n\nWomen's Brand Logo Relaxed Fit T-Shirt\n\n₹1,599\n\n₹1,999\n\nNEW!\n\nWomen's Striped Light Green Collar Neck Top\n\n₹1,599\n\n₹1,999\n\nNEW!\n\nWomen's Brand Logo Relaxed Fit T-Shirt\n\n₹799\n\n₹999\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/pages/returns?srsltid=AfmBOoq6A_l7mb4zkX0kuEetQIHirujGLWbVd5B95cP1XoTYQ4Xj5x07",
      "title": "Returns – Levis India Store",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nRETURNS\nRETURN POLICY\nREFUNDS\nITEM DAMAGED DURING SHIPMENT\nEXCHANGE\nIN-STORE RETURNS AND EXCHANGE\nFAQS\nRETURN POLICY\n\nReturning an item is easy. If you're not satisfied with your purchase, you can initiate a return online. Please note that items must be returned within 15 days of the order confirmation date and that items are in their original condition, where the item is unworn, unwashed, without alterations and has all tags attached. Levi.in reserves the right to deny refund if the item does not meet its Return Policy guidelines. Final sales, promotional items or opened packaged items may not be exchanged, returned or refunded. \n\nReturns are not available on the orders placed using the promo NORETURN and BUY2GET2. Only size exchanges are allowed.\n\nWe guarantee our merchandise to be free of manufacturing defects. If you receive a damaged or defective item, or your item proves to be defective in workmanship or materials within 15 days with normal wear (excluding stains), we will always accept the item for assessment and provide a refund if validated as faulty. Such returns have to be initiated with our customer care and not via online returns.\n\nIf you miss your return pickup, one more attempt will be made to pick up your return package on the following business day. After the second failed attempt, the return request will be cancelled.\n\nAs soon as we receive your return in our warehouse, we will proceed with the returns check and validation. Once the return has been approved, we will notify you by email and your refund will be credited within 15 days. If you return is not approved, a member of our Customer Care team will be in touch.\n\nPlease do not hand over any additional items to the shipping partner during return pickup. If you wish to return more products, please get in touch with our Customer Care team, who will arrange a pickup for the additional products. We will not be responsible for refund of additional/ unaccounted products lost in transit.\n\nREFUNDS\n\nRefunds will be made to the same form of payment originally used for the purchase within 15 days. Please note that refund payment times are dictated by the issuing bank and are outside our control. Please consult your bank for more information.\n\nFor Cash on Delivery (COD) orders ref, nds will be issued through bank/UPI transfers only. Please add correct details while placing your online return request. In case of failure, you will receive a link, using which you can initiate refund on your preferred mode.\n\nPlease note that we are unable to issue refunds through cash or cheque.\n\nIf an item is returned that does not comply with our Returns Policy, we will not approve and process the refund. We reserve the right to not return an item which does not comply with our Returns Policy. Please contact our Customer Care team to enquire about the validity of your return if you are unsure.\n\nITEM DAMAGED DURING SHIPMENT\n\nIf you received an item which is damaged upon arrival, please contact our Customer Care team immediately. You have the right to a full refund on all shipments that arrive damaged provided you inform us within 1 week of receiving the package.\n\nTo return an item, please follow the Return Instructions. Once the item is received we will assess and validate. If approved, we will refund the purchase price of the damaged item.\n\nEXCHANGE\n\nYou can exchange your order once within 15 days of order confirmation date. Please note that items should be in their original condition, where the item is unworn, unwashed, without alterations and has all tags attached. Levi.in reserves the right to deny to reject if the item does not meet its Policy guidelines.\n\nItems bought on sale will only be valid for exchange.  \n\nWARRANTY\n\nAt Levi's, we stand behind the quality of our products and want you to love every purchase. A 6-Months warranty backs all Levi's India products against manufacturing and material defects (excluding normal wear and tear). \n\nExamples of Manufacturer Defects: A manufacturer defect is any irregularity or flaw that goes beyond normal wear and tear. Here are some examples:\n\nStitching Issues: Uneven or frayed stitching affecting structural integrity.\nFaulty Zippers or Buttons: Malfunctioning closures hindering normal use.\nMisalignment of Pockets: Uneven or misaligned pocket sewing.\nIssues with Hardware: Problems with rivets, grommets, or metal components.\n\nUnderstanding Jeans Warranty: Small Holes and Wear & Tear\n\nIt's essential to clarify what's covered under our warranty when it comes to small holes that appear over time.\n\nOur warranty is designed to protect against manufacturing defects, such as issues with stitching or material quality. However, normal wear and tear—like small holes from regular use—isn't typically covered under warranty.\n\nHere are more examples of wear and tear that are considered normal with regular use of jeans:\n\nFading: Over time, jeans naturally fade due to washing and exposure to sunlight.\nStretching: Fabric can stretch with regular wear, especially in areas like the knees and seat.\nAbrasion: Friction from everyday use can cause slight abrasion on fabric surfaces.\nMinor Pilling: Small balls of fibers may form on the fabric surface, particularly in high-friction areas.\nColor Transfer: Some dye from jeans may transfer onto other fabrics, especially when new.\nHem Wear: The bottom edge of jeans may show signs of wear or fraying over time.\nBelt Loops: Belt loops can wear down with frequent belt use.\n\nHow to Initiate a Warranty Claim:\n\nSend an email to customercare@levi.in. Attach pictures of the defect, size label, country label, and product style label.\nYou will receive an email confirmation when a claim has been received.\nWait 3-4 business days for processing.\n\nWarranty Program Details:\n\nIf we confirm a defect, we'll send you a voucher for a replacement at Levi.in. It's important to keep in mind that the voucher is for one-time use only. Any funds not utilized towards the purchase of your replacement garment are non-refundable.\nNote: The voucher will not be replaced if you return or exchange the replacement garment for any reason.\nLost or stolen vouchers won't be replaced.\nOne product per claim, up to six claims every six months. Claims exceeding the limit won't be accepted. LS&CO reserves the right to modify or terminate this policy at any time without notice. Final decisions can't be re-inspected.\n\nPhoto Instructions:\n\nSend at least two clear images of the defect, the size label, and the product care label.\nImages must be sharp and clear, and numbers on the size tag must be legible.\n\nPhoto Examples:\n\n\n\n\n \n\nWe hope this guide makes your warranty claim process easy. Remember proper care ensures your jeans stay in top condition.\n\nIN-STORE RETURNS AND EXCHANGE\n\nProducts bought on Levi.in cannot be returned or exchanged at our retail stores. Please follow our online return process. Similarly products bought online cannot be returned/exchanged in our retail stores.\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/apps/return_prime?srsltid=AfmBOor7c_2ym9FtxMwA6-T7Zx9Ycep0-UtMfmUzkUGuHtzs0UAcqUYV",
      "title": "Returns & Exchanges",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\n\n\n\n\n\n\n\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/products/womens-mid-rise-regular-fit-jeans-a55330001?srsltid=AfmBOoq0fcD7zg0dgKeRXvafIClg2I-sT32ZCnVtoDJ_tZjPF8OMGxRy",
      "title": "Women's High Rise Loose Fit Jeans",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nHome \n\nWomen's High Rise L...\n\nSkip to product information\nWOMEN'S HIGH RISE LOOSE FIT JEANS\n5.0 out of 5 stars, average rating value. Read a Review. Same page link.\n5.0\n \n(1)\nWrite a review\nRegular price\n₹4,099.00\nSale price\n₹2,459.00\n40% OFF\n\nInclusive of all taxes\n\nExtra 15% Off on Rs. 3499\n\nColor:\n\nGrey\n\nVariant sold out or unavailable\n\nSize\n\nSIZE CHART\n25\nVariant sold out or unavailable\n26\nVariant sold out or unavailable\n27\nVariant sold out or unavailable\n28\nVariant sold out or unavailable\n30\nVariant sold out or unavailable\n32\nVariant sold out or unavailable\n34\nVariant sold out or unavailable\n\nLength\n\n30\nVariant sold out or unavailable\n\nSelect Quantity:\n\nDecrease quantity for Women&#39;s High Rise Loose Fit Jeans\nIncrease quantity for Women&#39;s High Rise Loose Fit Jeans\n\nQTY Limit Reached!\n\nDelivery Eligibility\n\nEnter Pincode\n\nCheck\nSold out\nBUY NOW\n15 Days Returns\nCash on Delivery\nPriority Delivery\n\nDescription\n\nFit and Sizing\n\nComposition and Care\n\nAdditional Details\n\n  \nREVIEWS\nRating Snapshot\nSelect a row below to filter reviews.\n5 stars\nstars\n\t\n\t1\n1 review with 5 stars.\n\n4 stars\nstars\n\t\n\t0\n0 reviews with 4 stars.\n\n3 stars\nstars\n\t\n\t0\n0 reviews with 3 stars.\n\n2 stars\nstars\n\t\n\t0\n0 reviews with 2 stars.\n\n1 star\nstars\n\t\n\t0\n0 reviews with 1 star.\nRate Product\n5.0\n1 Review\nReview this Product\nSelect to rate the item with 1 star. This action will open submission form.\nSelect to rate the item with 2 stars. This action will open submission form.\nSelect to rate the item with 3 stars. This action will open submission form.\nSelect to rate the item with 4 stars. This action will open submission form.\nSelect to rate the item with 5 stars. This action will open submission form.\nAdding a review will require a valid email for verification\nFilter Reviews\nSearch topics and reviews search region\nRating\nLocale\n1 to 1 of 1 Review\n1 – 1 of 1 Review\nRegional reviews\nDisplay a popup with information about Regional Sort.\nSort by\nRegional\nREGIONAL REVIEWS\n5 out of 5 stars.\nSuper Stylish\nkvk\na year ago\nit was slightly over size. So cancelled and ordered smaller size. DELIVERY, RETURN PICKUP AND REFUND process was impeccable.\nHelpful?\n(0)\n(0)\nReport\n\nYOU MAY ALSO LIKE\n\n40% OFF\n\nWomen's High Rise Loose Fit Jeans\n\n₹2,279\n\n₹3,799\n\n40% OFF\n\nWomen's Skinny Fit Jeans\n\n₹2,939\n\n₹4,899\n\n40% OFF\n\nWomen's Bootcut Jeans\n\n₹2,579\n\n₹4,299\n\n40% OFF\n\nWomen's Loose Straight Fit Bootcut Jeans\n\n₹2,279\n\n₹3,799\n\n40% OFF\n\nWomen's High Rise Loose Fit Jeans\n\n₹2,459\n\n₹4,099\n\n40% OFF\n\nWomen's Straight Fit Jeans\n\n₹2,579\n\n₹4,299\n\n40% OFF\n\nWomen's Straight Fit Jeans\n\n₹3,119\n\n₹5,199\n\n40% OFF\n\nWomen's Mid Rise 80S Loose Fit Jeans\n\n₹1,679\n\n₹2,799\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/products/levis-mens-trucker-jacket-a27940008?srsltid=AfmBOopkRmWMghL2cMOF-iGdah-D5Pgbu-CBrIjz4IBgpArwkka04MnP",
      "title": "Men's Solid Spread Collar Denim Jacket",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nHome \n\nMen's Solid Spread ...\n\nSkip to product information\nMEN'S SOLID SPREAD COLLAR DENIM JACKET\n4.0 out of 5 stars, average rating value. Read 4 Reviews. Same page link.\n4.0\n \n(4)\nWrite a review\nRegular price\n₹4,999.00\nSale price\n₹2,700.00\n45% OFF\n\nInclusive of all taxes\n\nExtra 15% Off on Rs. 3499\n\nColor:\n\nBlue\n\nVariant sold out or unavailable\n\nSize\n\nSIZE CHART\nS\nVariant sold out or unavailable\nM\nVariant sold out or unavailable\nL\nVariant sold out or unavailable\nXL\nVariant sold out or unavailable\nXXL\nVariant sold out or unavailable\n\nSelect Quantity:\n\nDecrease quantity for Men&#39;s Solid Spread Collar Denim Jacket\nIncrease quantity for Men&#39;s Solid Spread Collar Denim Jacket\n\nQTY Limit Reached!\n\nDelivery Eligibility\n\nEnter Pincode\n\nCheck\nSold out\nBUY NOW\n15 Days Returns\nCash on Delivery\nPriority Delivery\n\nDescription\n\nFit and Sizing\n\nComposition and Care\n\nAdditional Details\n\n  \nREVIEWS\nRating Snapshot\nSelect a row below to filter reviews.\n5 stars\nstars\n\t\n\t2\n2 reviews with 5 stars.\n\n4 stars\nstars\n\t\n\t0\n0 reviews with 4 stars.\n\n3 stars\nstars\n\t\n\t2\n2 reviews with 3 stars.\n\n2 stars\nstars\n\t\n\t0\n0 reviews with 2 stars.\n\n1 star\nstars\n\t\n\t0\n0 reviews with 1 star.\nRate Product\n4.0\n4 Reviews\n1 out of 1 (100%) reviewers recommend this product\nReview this Product\nSelect to rate the item with 1 star. This action will open submission form.\nSelect to rate the item with 2 stars. This action will open submission form.\nSelect to rate the item with 3 stars. This action will open submission form.\nSelect to rate the item with 4 stars. This action will open submission form.\nSelect to rate the item with 5 stars. This action will open submission form.\nAdding a review will require a valid email for verification\nFilter Reviews\nSearch topics and reviews search region\nRating\nLocale\n1 to 4 of 4 Reviews\n1 – 4 of 4 Reviews\nRegional reviews\nDisplay a popup with information about Regional Sort.\nSort by\nRegional\nREGIONAL REVIEWS\n3 out of 5 stars.\nVintage Denim Jacket\navishek\na year ago\njust bought this classic jacket. color extremely light blue with silver hue. sleeves are long for L or above sizes.fittings is a bit on the loose side.\nHelpful?\n(0)\n(0)\nReport\n3 out of 5 stars.\nThe Product Colour Is Not Seen Well In The Images\nKamlesh\na year ago\nI had been using a Levi's denim for the past close to 30 years and decided to pick up a new one. This picture shows it to be be light blue, sky blue but its silverish in colour. Also the denim material is good BUT its wayyyyyy softer than my regular denim.... it wears very comfortable but the fit was 1/2 size larger. I had to return it.\nHelpful?\n(0)\n(0)\nReport\nGLOBAL REVIEWS\n5 out of 5 stars.\nQuality Product\nJay\na year ago\nNice texture and color. The cloth was of heavy quality and thickness.\nQ: Size Purchased\nA: M\nQ: What size do you usually wear?\nA: L\nHelpful?\n(0)\n(0)\nReport\n5 out of 5 stars.\nAmazing.\nAvishek\na year ago\nBeautiful. Solid item. Great. Fantastic. Unbelievable.\nQ: Size Purchased\nA: 36\nQ: What size do you usually wear?\nA: 36\n\nYes, I recommend this product.\n\nHelpful?\n(0)\n(0)\nReport\n\nYOU MAY ALSO LIKE\n\n45% OFF\n\nMen's Solid Spread Collar Denim Jacket\n\n₹3,132\n\n₹5,799\n\n46% OFF\n\nMen's Solid Blue Spread Collar Denim Jacket\n\n₹3,780\n\n₹7,000\n\nBest price: ₹3213\n\n65% OFF\n\nMen's Solid Spread Collar Denim Jacket\n\n₹5,075\n\n₹14,500\n\nBest price: ₹4314\n\n46% OFF\n\nMen's Solid Spread Collar Denim Jacket\n\n₹2,483\n\n₹4,599\n\n50% OFF\n\nMen's Solid Spread Collar Denim Jacket\n\n₹2,499\n\n₹4,999\n\n45% OFF\n\nMen's Solid Spread Collar Denim Jacket\n\n₹3,294\n\n₹6,099\n\n46% OFF\n\nMen's Solid Indigo Spread Collar Denim Jacket\n\n₹3,239\n\n₹5,999\n\n40% OFF\n\nWomen's Solid Spread Collar Denim Jacket\n\n₹2,759\n\n₹4,599\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    },
    {
      "url": "https://levi.in/products/womens-high-rise-724-straight-fit-jeans-676670073?srsltid=AfmBOopQw_GYEc_FPhKRmNZ3QR6PlHAz0z5Zb19zrpqKIP1nIBH4d-IJ",
      "title": "Women's High Rise 724 Straight Fit Jeans",
      "content": "Extra Rs. 300 off on Rs. 2999 Use Code: NEW300\n\nSign In\nSALE\nMEN\nWOMEN\nNEW ARRIVALS\nBLOG\nFEATURED COLLECTIONS\n0\nCart\nSkip to content\nHome \n\nWomen's High Rise 7...\n\nSkip to product information\nWOMEN'S HIGH RISE 724 STRAIGHT FIT JEANS\n1.0 out of 5 stars, average rating value. Read a Review. Same page link.\n1.0\n \n(1)\nWrite a review\nRegular price\n₹3,599.00\nSale price\n₹1,799.00\n50% OFF\n\nInclusive of all taxes\n\nExtra 15% Off on Rs. 3499\n\nColor:\n\nGrey\n\nSize\n\nSIZE CHART\n25\nVariant sold out or unavailable\n26\n27\nVariant sold out or unavailable\n28\nVariant sold out or unavailable\n30\nVariant sold out or unavailable\n32\nVariant sold out or unavailable\n34\nVariant sold out or unavailable\n\nLength\n\n30\n\nSelect Quantity:\n\nDecrease quantity for Women&#39;s High Rise 724 Straight Fit Jeans\nIncrease quantity for Women&#39;s High Rise 724 Straight Fit Jeans\n\nDelivery Eligibility\n\nEnter Pincode\n\nCheck\nADD TO BAG\nBUY NOW\n15 Days Returns\nCash on Delivery\nPriority Delivery\n\nDescription\n\nFit and Sizing\n\nComposition and Care\n\nAdditional Details\n\n  \nREVIEWS\nRating Snapshot\nSelect a row below to filter reviews.\n5 stars\nstars\n\t\n\t0\n0 reviews with 5 stars.\n\n4 stars\nstars\n\t\n\t0\n0 reviews with 4 stars.\n\n3 stars\nstars\n\t\n\t0\n0 reviews with 3 stars.\n\n2 stars\nstars\n\t\n\t0\n0 reviews with 2 stars.\n\n1 star\nstars\n\t\n\t1\n1 review with 1 star.\nRate Product\n1.0\n1 Review\n0 out of 1 (0%) reviewers recommend this product\nReview this Product\nSelect to rate the item with 1 star. This action will open submission form.\nSelect to rate the item with 2 stars. This action will open submission form.\nSelect to rate the item with 3 stars. This action will open submission form.\nSelect to rate the item with 4 stars. This action will open submission form.\nSelect to rate the item with 5 stars. This action will open submission form.\nAdding a review will require a valid email for verification\nFilter Reviews\nSearch topics and reviews search region\nRating\nLocale\n1 to 1 of 1 Review\n1 – 1 of 1 Review\nRegional reviews\nDisplay a popup with information about Regional Sort.\nSort by\nRegional\nREGIONAL REVIEWS\n1 out of 5 stars.\nReturn Not Picked Up Yet\nRuby\n2 months ago\nWanted to return the product nobody come to pick up yet\n\nNo, I do not recommend this product.\n\nHelpful?\n(0)\n(0)\nReport\n\nYOU MAY ALSO LIKE\n\n50% OFF\n\nWomen's High Rise 724 Straight Fit Jeans\n\n₹1,699\n\n₹3,399\n\n40% OFF\n\nWomen's High Rise 724 Straight Fit Jeans\n\n₹2,279\n\n₹3,799\n\n50% OFF\n\nWomen's High Rise 724 Straight Fit Jeans\n\n₹1,899\n\n₹3,799\n\n50% OFF\n\nWomen's High Rise 724 Straight Fit Jeans\n\n₹1,699\n\n₹3,399\n\n40% OFF\n\nWomen's High Rise 724 Straight Fit Jeans\n\n₹2,279\n\n₹3,799\n\n40% OFF\n\nWomen's High Rise 724 Straight Fit Jeans\n\n₹2,039\n\n₹3,399\n\n50% OFF\n\nWomen's High Rise 724 Straight Fit Jeans\n\n₹2,049\n\n₹4,099\n\n40% OFF\n\nWomen's High Rise Loose Fit Jeans\n\n₹2,279\n\n₹3,799\n\nQUICK LINKS\n\nMen's Jeans\nWomen’s Jeans\nMen’s T-shirts\nWomen’s Tops\nFootwear\nMen’s Jackets\nRed Tab Member Program\nStore Locator\n\nSUPPORT\n\nHelp\nReturns & Exchanges\nShipping\nAbout Us\n\nCONTACT\n\nFor Customer care\n\ncustomercare@levi.in\n\nFor Order Escalation\n\nfeedbacklevi@levi.in\n\nFor Corporate Orders\n\ncorporatesales@levi.in\n\nFor Online Orders\n\n1800-123-5384\n\nFor Store Queries\n\n1800-1020-501\n\nCall Timings\n\nMon-Sat : 10AM - 6PM\n\nITS ALL ABOUT THE PERKS\n\n*See Details for Terms and Conditions and See Privacy Policy for our privacy practices.\n\nSubscribe\nPayment methods\n© 2025, Levis India Store\nPrivacy Policy\nTerms of use\nReturns\nCorporate Information\nPinterest\nInstagram\nYouTube\nTwitter"
    }
  ]
}