{
  "links": [
    {
      "url": "https://www2.hm.com/en_in/customer-service/legal-and-privacy/terms-and-conditions.html?srsltid=AfmBOooDYlkr2i40XG8K6yq1tRCb4LoFK2YsLZ4AW7FM3mhIg3QyY42o",
      "title": "Terms & Conditions | Online Store"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/shipping-delivery.html?srsltid=AfmBOoqizpFSpc9caUjh4FZd1pXpjhKW6HVpM6R1EgPSwL4kEeWJptMx",
      "title": "Delivery & Shipping | Next-Day Delivery"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/shipping-delivery.modal.html?srsltid=AfmBOopt1RSs0VA07Dgq7kW0s_PLJgt6O6GHACgNiNxvBcweX7315Hlq",
      "title": "order delivery in two packages"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/returns.html?srsltid=AfmBOopZnR_dtfAdoDQZW8XfR17zCI6XHyscj3yJkPx6VqOA1axNfE52",
      "title": "Return Policy & Methods | Refunds & Exchanges"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/return-link.html?srsltid=AfmBOoo_C2FOoitIjdpn5I16SdVvUHAOzD3ofwwRUlT0XFkRwSyu18zb",
      "title": "Online Returns"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/shopping-at-hm/online-shopping.html?srsltid=AfmBOoqWzU9hh3stC2odBjp7MSDS1e5jBtahH_gnX7IvaAtCwztCEDaQ",
      "title": "Online Shopping at H&M | FAQs & T&Cs"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/h-m-club/h-m-club-terms-conditions.html?srsltid=AfmBOorR4QxYc6CWcRGrpDIvTaK_yo9mgeWcMXxAfkTDOzYjkBPXtfJf",
      "title": "H&M Membership Terms & Conditions"
    },
    {
      "url": "https://www2.hm.com/en_in/member/info.html?srsltid=AfmBOopqagSURQJBsPu__gIk9hteZzyunMEvXYGuGtyrAvFnvJJBzc4u",
      "title": "H&M Membership | Join to Collect Points & Rewards"
    },
    {
      "url": "https://www2.hm.com/en_in/member/offers/bonus.html?srsltid=AfmBOorrhACkdBHB0bQej9p3nUsXuRJfM0nvaG3377-pOk4uh8HyohCp",
      "title": "bonus"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/smsinfo.html?srsltid=AfmBOoqbGMEegYpMiUV2XF7DIUplmgR80SPtnZRbokhAJIAgSiWT6shY",
      "title": "SMS Info"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/returns.html?srsltid=AfmBOopy6stoCL_GV0Yp-7yTBfat0eeb056cV-WwwpM6bqNzAZ-D9yTA",
      "title": "Return Policy & Methods | Refunds & Exchanges"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/return-link.html?srsltid=AfmBOoqpSZ3lpcmvVCCEPUVU6ERq0FqOS49Cy7toMkXwNSaIgexmTRXY",
      "title": "Online Returns"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/legal-and-privacy/terms-and-conditions.html?srsltid=AfmBOorPVD0DILL9MMyRc02xPuH7l5Baxe8VPD6nMkcYOxT-oWXc2uqE",
      "title": "Terms & Conditions | Online Store"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service.html?srsltid=AfmBOoofsgnJLf1b6V-Ic6c_7p0teuNxxXodJlsogFnTQ9yTgs90UdD_",
      "title": "Customer Service | Help & Support"
    }
  ],
  "page_text": [
    {
      "url": "https://www2.hm.com/en_in/customer-service/legal-and-privacy/terms-and-conditions.html?srsltid=AfmBOooDYlkr2i40XG8K6yq1tRCb4LoFK2YsLZ4AW7FM3mhIg3QyY42o",
      "title": "Terms & Conditions | Online Store",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/Legal & privacy/Terms & Conditions\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nTERMS & CONDITIONS\n\n\n1. General\n\n1.1 Hey H&M friend, welcome to our terms and conditions! We are so happy you've made it here. This may not be the most exciting document you'll ever read, but it is important to establish what you can expect from us and what we expect from you. And just to be clear, when we say \"us\", \"we\" or \" H&M\", we mean H&M Hennes & Mauritz Retail Private Limited .\n\n1.2 These terms and conditions apply when you place an order with us via the website www2.hm.com, or our mobile application the H&M App (from now on referred together to as the \"Online Store\").\n\n1.3 By placing your order you agree to be bound by these terms and conditions, or the \"Terms\" as we will call them from now on. Therefore, please make sure you have read and understood them before ordering. \n\n1.4. Only persons who can enter into legally binding contract under the Indian Contract Act, 1872 can use and/or transact on the Online Store. Also, meaning that you must be at least 18 years old or above. If you are under 18 years, you may use and/or transact on the Online Store only with the involvement of a parent or a guardian. You must also have a valid email address and a delivery address in India. \n\n1.5 You may not place an order for corporate, commercial or self-employed activities. We do not issue commercial  Goods and Services Tax (GST) invoices for corporate use.\n\n1.6 H&M wants to provide the best possible online experience. To make this possible we need to ensure that our services runs like a clockwork. You understand and agree not to (i) post, transmit, redistribute, upload, or promote any communications or content that could harm or negatively impact our business, products or services; (ii) act in a manner or employ any device that restricts, impairs, interferes or inhibits any other user from using or enjoying the hm.com site, or which impacts the security of the site, or (iii) employ any device or attempt to use any engine, software, tool, agent, script or other device or mechanism (including without limitation spiders, bots, crawlers, avatars or intelligent agents) to navigate or search the site, or to copy content from the site. We reserve the right to immediately bar access to the site and close the account of a user who violates any of the provisions of these terms and conditions or whose acts, as per H&M’s understanding, are detrimental to the interests of H&M in any manner. \n\n1.7 H&M sells its products directly through Online Store and online marketplace (collectively referred to as “Authorized Online Stores”) and not through any other third party(s) or agent(s). You may please contact our Customer Service if you wish to know further details on the Authorized Online Stores.  \nH&M does not control, endorse or accept responsibility for any products proposed to be sold or offered to be sold or purchased on the website or any linked sites other than the Authorized Online Stores. H&M makes no representations or warranties whatsoever about and shall not be liable for any transaction through such third partie(s) or agent(s) including representations relating to merchantability, fitness of a product or service for a particular purpose, warranty as to specific products and non-infringement of third party intellectual property rights. Any transactions that you may have with such third partie(s) or agent(s) are at your own risk. H&M also does not accept any responsibility for the usage of the products, fraudulent or illegal activities, non- payment, delivery of the products purchased by you from such third partie(s) or agent(s) .\n\nH&M specifically disclaims any liability with regard to any infringing, illegal,  fake, spurious, duplicate, counterfeit or defective, refurbished products purchased by you from such third party.\n\n\n1.8 We have the right to amend these Terms, but the Terms that you approve at the time of your purchase will always apply for that particular purchase. Any changes made will be included in the latest published version of the Terms in the Online Store. Changes to the Terms will be effective from the time you accept the Terms, i.e. in connection with you making a new purchase. This means that we might and probably will change our Terms every now and again, so keep on visiting this page to stay up to date. \n\n \n\n2.Prices and delivery charges\n\n2.1 The prices displayed in the Online Store include the applicable statutory tax  /Goods and Services Tax (GST), but do not include delivery charge. In the checkout view, the total cost for your purchase including delivery charge will be displayed.\n\n2.2 Please note that prices in the Online Store can differ from prices in our physical stores.\n\n2.3 The cost for delivery is shown in the checkout view. You can also find more information here. Our standard delivery fee is Rs. 149. If we are unable to deliver your order in full and must make more than one delivery, you will only be charged for the single delivery.\n\n2.4 We may from time to time offer promotions, discount codes, gifts and other offers. Such offers are valid only for the period specified in connection with such offers and on the terms directly associated with them. Offers cannot be combined with other discounts unless expressly stated otherwise in the Online Store. You need to fill in the discount code for the offer before completing the purchase in order to use the offer.\n\n\n3. Ordering\n\n3.1 Do you want to place an order? Great! This is how you do it. You collect the items you wish to order in your shopping bag using the “Add to bag” button. In the shopping bag view, you can review your order and remove any item you have changed your mind about before proceeding to the checkout. When you place your order by clicking the “Complete purchase” button, you are making a binding offer to purchase the items in the shopping bag. Depending on your selected payment method, further steps may be required to finalise your payment.\n\n3.2 On receipt of your order, we will send you an automatic email confirmation that your order has been placed. Please note that a placed order is an offer and does not constitute a binding contract until the order has been approved by us. If we approve your order, we will send you a shipping confirmation email that includes all relevant information about your order and its delivery. The shipping confirmation email is our approval of your order and the conclusion of our contract. Yay!  \n\n3.3 For various reasons, we may not be able to approve your order. We reserve the right to not approve your order for any 3.3.a. operational, 3.3.b. legal, or 3.3.c. commercial reason. For example, this could be the case if the item you ordered is defect and we have no more items in stock, or in case we suspect that items are being ordered for commercial reselling purposes. If we are unable to approve your order, we will let you know at the earliest opportunity after the automatic email confirmation has been sent, but naturally before we approve your order and send you the shipping confirmation.\n\n3.4 If we have already received payment for an order that is not approved by us, we will attempt to refund the applicable amount using the same method you used to make the payment. If alternative arrangements are necessary for any reason, we will contact you to settle the refund.\n\n \n\n4. Payment methods\n\nYou can pay for your goods in various ways as set out below. Depending on the payment method you choose, additional costs and terms may apply.\n\n\n4.1 Payment before or at delivery\n\nCredit card or debit card\nYou can enter your payment details at the time you place your order using a valid credit or debit card (VISA ,Mastercard,Rupay or such other option(s) as offered at our Online Store). The applicable amount will immediately be debited from your card. H&M reserves the right to check the validity of the credit or debit card, its credit status in relation to the order value and whether the address data of the purchaser is correct. We may refuse orders depending on the result of these checks.\n\nCash on Delivery\nYou may choose to pay by cash on delivery upon receipt of the goods, without any additional charges.\n\nEMI\nYou may choose EMI as a payment method provided by various banks. Additional interest charges are applicable depending on the tenure and amount involved.\n\nUPI \nYou may choose to pay your order with UPI. The order value will be debited from the associated bank account when you have placed your order at the checkout page.\n\nNET BANKING\nYou may choose to pay for your order via net banking. The order value will be debited from the associated bank account when you have placed your order at the checkout page.\n\n4.2 Other\nYou will receive your receipt/tax invoice in the order delivered e-mail as well as in the order package delivered to you.\n\n4.3 You are requested to see our Privacy Policy to see how your personal information will be used and stored\n\n\n5. Delivered\n\n5.1 So, when will my order arrive, you wonder? In the checkout view, before placing your order, you will be informed of the  estimated delivery time following our approval of your order. You can also find more information at Delivery Policy . If we approve your order, you will receive a shipping confirmation email containing all relevant information about your order. \nFor delivery of products such as larger rugs and furniture from our external H&M HOME range, please allow 5-14 business days. You can find our full shipping and delivery policy here.\n\n5.2 Even though we do our very best to deliver within the communicated time frame, delivery may sometimes take longer due to unexpected events. If your order does not arrive by the estimated time of delivery, please contact Customer Service and they will try their best to help you.\n\n5.3 Sometimes life gets in the way, and you forget to respond to the carrier. That's fine, we've all been there. However, if your order cannot be delivered after 3 attempts, the order shall be returned back to origin. No cost of return will be charged to you. Subsequently, your order amount will be automatically refunded to you in the original form of payment. \n\n5.4 H&M reserves the right of not delivering the order to you in case of force majeure events, political unrest or other unforeseen circumstances.  \n\nIn case a delivery is temporarily not possible for your location or pin code on account of factors mentioned hereinabove, then your order will not be placed on our Online Store, and you will be notified of the same.\n\nWhereas in cases where your order is successfully placed on the Online Store  and subsequently your location or pin code becomes temporarily unserviceable, and incase the order has already been picked up by the delivery partner, then the delivery partner will attempt delivery with extended timelines if the specific dates for delivery are clearly available. However, if there are no specific timelines available, then the parcel will be returned to the origin and the refund process will be initiated.\n\nIn case your order is placed and if your location or pin code is not serviceable before the order has been packed, then H&M will cancel your order and notify you through email and a refund shall be initiated to you upon such cancellation. \n\n\n6. Returns\n\n6.1 Changed your mind? No problem. You have the right to return any or all items in your order for any reason at all, by notifying us and returning the items within 15 days after your receipt of the order.\n\nYou can return your order by simply placing a return request on the Online Store.\n\nYou can go to My Orders on Your account page, then click on the order you want to return, select the item to be returned and submit the request. After that, please place the item you wish to return in the parcel the item was received in and hand it over to the delivery person assigned to carry out the pick-up.\n\nIf you want to arrange for the return of your item in an alternative manner, then please contact Customer Service. \n\n6.2 Please include the correct and complete item in the parcel, otherwise we  will not be able to process your return. We want to highlight that you can only return items purchased from  the Online Store. You cannot return/ include items purchased from our physical stores in the parcel. \n\n6.3 If you choose to make a return, we will refund you the order value except the cost of delivery. Furthermore, should you choose to keep certain items and only return parts of your order, the delivery cost will not be refunded.  \n\n6.4 The refund will be made to the same payment method you used to place the order, within 30 days of us receiving the items back. If you have not received your refund within 30 days, please contact Customer Service and we will help you.\n\nRead more about our Return/refund policy on hm.com\n\n6.5 We will give you a full refund for any returned item provided that it is returned in the same condition as it was in upon your receipt. If an item in any way has been damaged, soiled, washed, altered or worn (other than to try the item on) and the value of the item has been reduced, in such cases we offer no refund. \n\n6.6 The right of withdrawal and return does not apply to products which are unsuitable for return, such as certain underwear, swimwear, piercing Jewellery, face masks, beauty products and cosmetics due to health protection or hygiene reasons.\n\n6.7 For more information about returns, click here  hm.com\n\n\n7. Defects\n\n7.1 If there are defects in the goods you have purchased, H&M abides by all statutory regulations. If you have a complaint regarding obvious material or manufacturing faults in goods that we have supplied, including damage incurred in transit, please let us know by returning the goods to us by initiating the return process under the Returns section on hm.com \n\n\n7.2 If an item you have received is defective and you notice the defect within 15 days after your receipt of the item, you may choose to follow the instructions in section 6 (Returns). Please select the option “Defective/Broken Item” while placing a return request on the Online Store. \n\n\n8. Our liability\n\n8.1 All reasonable efforts are made to ensure that information in our Online Store is accurate, complete, and current at the time of uploading on the Online Store. Despite our best efforts, information may occasionally be inaccurate, incomplete or out of date. Hence, we do not guarantee the accuracy of the Information and to the extent permitted by applicable law, H&M disclaims all representations and warranties, express or implied, that content or information displayed in or on the Online Store is accurate, complete, up-to-date and/or does not infringe the rights of any third-party. \n\n8.2 We do our best to accurately display and describe the attributes of our products in the Online Store regarding measurements, composition and colours. \n\nHowever, the colour you may see depends on your device. Our measurements are only approximate values to better estimate the model or fit of that specific item. It is not a guarantee of the actual measurements of the item you receive since the final measurements may vary depending on the material used in its production. If you are not satisfied with the item you ordered, you may return the item. Please see section 6 (Returns).\n\n\n8.3 What happens when things go really wrong? In case  an event beyond our control occurs, and which we are not able to reasonably overcome or anticipate, we will no longer have an obligation to fulfil our contract with you. Such an event might include government action or omission, new legislation, labour law conflict, war or danger of war, major disturbance of public order, sabotage, extreme weather conditions, fire, explosion, pandemic, epidemic, virus, and natural disasters. If any of these events occur, we are not obliged to compensate you for any damages. However, in such cases you may contact our Customer Service.\n\n8.4 H&M accepts no liability for any losses or damages which are not reasonably foreseeable arising out of or in connection with these Terms or your use of the Online Store.\n\nYou agree to indemnify and hold harmless H&M and (as applicable) H&M's parent, subsidiaries, affiliates, third-parties and their respective shareholders, officers, directors, agents, and employees, from any losses, liabilities, damages, costs and expenses, claims or demand, or actions including reasonable attorneys' fees asserted against or incurred by H&M, made by any third party arising out of your breach or non-performance of the Terms, or your violation of any law, rules or regulations or the rights of a third party.\n\nNothing in these terms shall exclude or limit H&M's liability with regard to any matter for which it would be unlawful for us to limit or exclude our liability.\n\nH&M accepts liability for death or personal injury caused by our negligence or that of our employees and agents. We do not seek to exclude liability for fraudulent misrepresentation by us or our employees or agents. If we breach these Terms, we shall only be liable for losses which are a reasonably foreseeable consequence of such breach.\n\nH&M is not responsible for indirect losses which are a side effect of the main loss or damage, for example loss of profits or loss of opportunity; or for failure to deliver the goods or to meet any of our other obligations under these Terms where such failure is due to an event that is beyond our reasonable control, which includes but is not limited to fire, flood, storm, riot, civil disturbance, war, nuclear accident and terrorist activity.\n\nOur maximum liability to you for any loss or damage arising in connection with your order on the Online Store  shall be limited to the total price of your order.\n\n\n9. Complaints and dispute resolution\n\n9.1 If you have a complaint regarding any of our products or services, please let us know by contacting Customer Service. Click the link: Customer Service\n\nIn the unlikely event that we are unable to resolve a complaint with you directly, you have the right to refer the dispute to the Grievance Officer.\n\nIn compliance with the Consumer Protection (E- Commerce) Rules, 2020, the details of the Grievance Officer are as mentioned below:\n\nGrievance Officer \n\nName: Mr. Jeetu Wadhwani (Customer Service – India)\n\nEmail Id: grievanceofficer.in@hm.com \nPhone No: 011-66786895\n\nAddress: H&M Hennes & Mauritz Retail Private\nLimited, A wing, 2nd Floor, D3, District Centre, Saket,\nNew Delhi 110017 India\n\nTimings: Monday to Friday 09:00 AM – 06:00 PM\n\n\n9.2 We adhere to all applicable laws including mandatory consumer protection legislation and we have no intention of excluding or restricting such rights you may have through these terms\n\n \n\n10. Severance\nSubject to applicable law, if any clause in these Terms is found to be unenforceable for any reason, this will not affect the enforceability of any other clause in these Terms.\n\n \n\n11.Governing Law and Dispute Resolution \nThese terms and conditions are governed by and construed in accordance with the laws of India. \n\nAny dispute that arises out of or is related to the interpretation of these terms and conditions, shall be subject to the exclusive jurisdiction of the Indian courts in New Delhi, India.\n\n\n12.Assignment\nH&M reserves the right to assign or pledge to third parties any claim(s) for payment which may have arisen in connection with the delivery of goods. \n\n\n13. Communications\nYou hereby consent to receiving communications including news, delivery and return related updates, offers/ campaign related messages from us, to the email address and/or the mobile phone number provided by you. \n\nFurther, by accessing and using the Online Store, you explicitly consent to receive such communications whether through call, SMS, email or through any other digital /electronic means from us and/or our authorized representatives. \n\nYou can at any time unsubscribe/ opt-out from receiving marketing/ promotional communications and our newsletters by following the instructions set out in such communications (if any) or by contacting our customer care.\n\n\n14. Intellectual Property\nAll trademarks, copyright and other intellectual property rights in all content including brand names and logos or software contained on the Online Store, including emails or any other form of communication with you is protected by copyright right laws and shall remain at all times vested in H&M Hennes & Mauritz AB and its subsidiaries or licensors.\n\nYou are permitted to use the content posted on our website only to the extent authorized by H&M. \n\nH&M may provide the functionality to allow you to provide product ratings and reviews (“User Content”) in relation to its products. \n\nIn such a case, you are solely responsible for such User Content, and the customer warrants that any User Content posted by you is accurate and that you are the sole author. \n\nYou hereby assigns to us all intellectual property rights in any User Content posted on the Online Store. H&M reserves the right to remove User Content which in its sole opinion is deemed to be incorrect, offensive, illegal or otherwise unacceptable.\n\n\n15. Company Information\nH&M Hennes & Mauritz Retail Private Limited \n\nRegistered office: A-Wing, 2nd Floor, D-3, District Centre Saket, New Delhi – 110017, India \n\nRegistered number: CIN- U74140DL2013FTC262231 \n\nContact Details: Customer Service\n\nEmail: customerservice.in@hm.com \n\nPhone:1800-889-8000\n\nFree of charge\n\n\n150624\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/shipping-delivery.html?srsltid=AfmBOoqizpFSpc9caUjh4FZd1pXpjhKW6HVpM6R1EgPSwL4kEeWJptMx",
      "title": "Delivery & Shipping | Next-Day Delivery",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/Delivery\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nDELIVERY\n\nEstimated delivery time: 2-7 days\n\nHave your items shipped in the way that best suits your busy life!\n\n\nCAN I CANCEL OR AMEND MY ORDER?\nORDER DELIVERY IN TWO PACKAGES\nWHERE WE DELIVER\nWHY DO SOME PRODUCTS IN MY ORDER HAVE DIFFERENT PACKAGING?\n\nTRACK YOUR PARCEL\n\n\nWe are committed towards a sustainable future! Reducing plastic packaging is one such step towards our commitment.\n\nAs soon as we start packing your order we will send you a shipping confirmation email with the delivery details and a link to track your parcel online. \n\n\nYou will also be able to track your order under ‘Orders’ when you sign in at My Account.\n\nPlease note, that it can take some time before the tracking information is uploaded.\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/shipping-delivery.modal.html?srsltid=AfmBOopt1RSs0VA07Dgq7kW0s_PLJgt6O6GHACgNiNxvBcweX7315Hlq",
      "title": "order delivery in two packages",
      "content": "DELIVERY\n\nEstimated delivery time: 2-7 days\n\nHave your items shipped in the way that best suits your busy life!\n\n\nCan I cancel or amend my order?\n\nWe start processing your order quickly which means we can’t make any changes once it’s confirmed. This includes changing the delivery address or delivery option. \n\nHowever, you may be able to cancel your order and place a new one instead as we have a short grace period after the order is confirmed. \n\n\nSign in to My Account and view your online orders under My Purchases. If the ‘Cancel Order’ button is visible, you can select this option and your order will be cancelled. If the button is not visible, it is too late to cancel your order as processing has begun. Should you need to, you can find out about return options instead here.\n\nORDER DELIVERY IN TWO PACKAGES\nUnder certain circumstances your order may be delivered in two packages and you would see this information on the checkout page. In this case no additional delivery fees will apply. Please note that if you have chosen to pay Cash on delivery, please pay for the packages separately as per the amount mentioned on the package as they might arrive at different times.\nWHERE WE DELIVER\n\nWe are delivering everywhere except containment zones.  \n\nWe deliver to customers who are 18 years and above, with an address in India. Please note, that some areas may be excluded from delivery. You will be notified about this during checkout.\n\nYou may choose to have your order delivered to your home or an alternative address. In checkout you can change the delivery address and/or add a new one.\n\nFor our Terms & Conditions, click here. \n\nWHY DO SOME PRODUCTS IN MY ORDER HAVE DIFFERENT PACKAGING?\n\nWe’re taking steps in our commitment to mostly using packaging materials from recycled or sustainable sources. As we are testing to find alternative solutions, your parcel might be packaged in a paper bag or you might have received items without individual polybags.\n\nThese steps are just some of the ways that we are exploring and contributing towards a sustainable future.\n\n \n\nTRACK YOUR PARCEL\n\n\nWe are committed towards a sustainable future! Reducing plastic packaging is one such step towards our commitment.\n\nAs soon as we start packing your order we will send you a shipping confirmation email with the delivery details and a link to track your parcel online. \n\n\nYou will also be able to track your order under ‘Orders’ when you sign in at My Account.\n\nPlease note, that it can take some time before the tracking information is uploaded."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/returns.html?srsltid=AfmBOopZnR_dtfAdoDQZW8XfR17zCI6XHyscj3yJkPx6VqOA1axNfE52",
      "title": "Return Policy & Methods | Refunds & Exchanges",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/Returns\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nRETURNS\n\n \n\n \n\nONLINE RETURNS\n\nLog in to our returns portal with your order number (it's in the order confirmation email) and the email address you used when you placed the order; and let us know what you want to return and why. \n\nThe return request must be raised with us within 15 days from the date you receive your parcel.\n\nRegister a return\n\nOnce you've registered your return via the portal, follow the instructions on how to send your return shipment. You can track your return via our track & trace page link shared in the Return pickup email, and once we received it we’ll email you.\n\n \n\nHOW TO MAKE A RETURN (ONLINE PURCHASE)\nONLINE RETURNS – FREQUENTLY ASKED QUESTIONS\nREFUNDS PAY ON DELIVERY (ONLINE PURCHASES)\nREFUNDS CARD (ONLINE PURCHASES)\nREFUNDS UPI (ONLINE PURCHASES)\nRETURNS & REFUNDS (STORE PURCHASES)\nDO YOU OFFER EXCHANGES?\nI DID NOT RECEIVE A RETURN FORM, WHAT SHOULD I DO?\n\n \n\nFor our Terms & Conditions, click here.\n\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/return-link.html?srsltid=AfmBOoo_C2FOoitIjdpn5I16SdVvUHAOzD3ofwwRUlT0XFkRwSyu18zb",
      "title": "Online Returns",
      "content": "RETURNS\n\n \n\n \n\nOnline returns\n\nLog in to our returns portal with your order number (it's in the order confirmation email) and the email address you used when you placed the order; and let us know what you want to return and why. \n\nThe return request must be raised with us within 15 days from the date you receive your parcel.\n\nRegister a return\n\nOnce you've registered your return via the portal, follow the instructions on how to send your return shipment. You can track your return via our track & trace page link shared in the Return pickup email, and once we received it we’ll email you.\n\n \n\nHOW TO MAKE A RETURN (ONLINE PURCHASE)\n\nHOW TO MAKE A RETURN\n\n\nReturns are free of charge.\n\nPlease keep in mind that online purchases must be returned via mail and cannot be returned in our physical stores. The return must be sent to us within 15 days from the date you received your parcel.\n\nSwimwear, underwear, pierced earrings, cosmetics and face masks cannot be exchanged & refunded due to hygiene reasons.\n\nH&M HOME items purchased online cannot be returned in our stores and must be returned through our returns portal only. To ensure successful return pick-up, please return the product in the same packaging as received.\n\nYou can easily return items by following these steps:\n1. Let us know which items you wish to return by registering your return online here. All you need is your order number & your registered email address and you can arrange collection of your return. \n\n2. Package the items you wish to return in a suitable bag or box, eg. the one you received your parcel in. Registering your return online means you don’t need to include any paperwork in your parcel.\n\n\n3. A courier from carrier partner will attach the return label on your parcel upon collection.\n\n\n4. The courier will provide you with proof of return. Please keep this for your records.\n\n\nIf you have received your order in two separate packages and need to make a return you can proceed in the same way by requesting a return digitally through our website or app.\n\nOnce we have received your return shipment in our warehouse, we will send you an email confirming receipt of the parcel. Please allow up to 14 days for this to happen. If you don’t receive the email within 14 days, please contact us.\n\n\n\nOnline Returns – Frequently asked questions\n\nWhat is Digital Returns?\nDigital Returns is a seamless process to book the returns digitally by simply visiting our H&M website under customer service return page.\n\nWhere can I find a link to Digital Return?\nYou will find the link to Digital return on our H&M website under customer service return page, in your order shipment email or you can simply click on the order under Myaccount to view the link for return. Additionally there is a QR code available in the hard copy Invoice received in your parcel which you can scan to view the link for Digital Return.\n\nWhat is the return timeframe?\nThe return request must be raised with us within 15 days from the date you receive your parcel.\n\nMy order was delivered in two packages, how do i proceed with my return?\nIf you have received your order in two separate packages and need to make a return you can proceed in the usual way by requesting a return digitally through our website or app.\n\nShowing an error while booking the return?\nEnsure you have cleared Cache and Cookies from your Browser and make sure you have entered the right order no and email address you used when you placed the order. If the issue still persist than contact Customer Service for further assistance \n\nCan I return part of my order?\nYes – You can return any item from your order.\n\nWhat details do I need to register a return digitally?\nIn order to register your return digitally, you will need to have an order no and email address you used when you placed the order.\n\nCan I change the mode of payment of my refund?\nNo – Refund will be made to the original mode of payment.\n\nFor pay on delivery orders please ensure your bank details are listed in your H&M account so we can refund the balance directly to your bank account. No cash refunds. \n\nDo I need to have a return label for returning an item digitally?\nNo – The Digital return is completely paperless and requires no return label.\n\nHow can I cancel my registered return?\nYou can cancel your registered return by simply following the link provided in your return confirmation email.\n\nHow many times a courier will make the attempt to collect my parcel?\nA courier will have a maximum of two attempts to collect your parcel, failing on 2nd attempt will auto cancel your registered return.\n\nHow can I view the status of my return parcel?\nYou can simply refer to your return confirmation email and click on 'track my return' or you can contact our Customer Service team.\n\nHow can I return incorrect item or faulty item?\nYou can return any incorrect item or faulty item by following the normal return procedure upon selecting the correct reason.\n\nHow can I return a wrong parcel?\nPlease contact Customer Service for the assistance.\n\nWhat all can I return?\nYou can return any item.  Swimwear, underwear, pierced earrings, cosmetics & fabric face masks cannot be exchanged & refunded due to hygiene reasons\n\nREFUNDS PAY ON DELIVERY (Online purchases)\n\nWe will refund within a period of 30 days from the date we receive the items you return (with labels and tags still attached), excluding the delivery fee.\n\nPlease ensure your bank details are listed in your H&M account so we can refund the balance directly to your bank account. No cash refunds.\n\nNote: Even if the courier accepted card or other non-cash payment upon delivery, we will still refund the balance to your bank account.\n\nOnce we have received your return, we will send you an email confirming receipt of the parcel and process your refund.\n\nREFUNDS CARD (ONLINE PURCHASES)\n\nWe will refund within a period of 30 days from the date we receive the items you return (with labels and tags still attached), excluding the delivery fee.\n\nIf you paid by card, we will issue your refund to the same card used when making the purchase.\n\nOnce we have received your return, we will send you an email confirming receipt of the parcel and process your refund.\n\nNote: Refunds can only be made to the original mode of payment.\n\nREFUNDS UPI (ONLINE PURCHASES)\n\nWe will refund within a period of 30 days from the date we receive the items you return (with labels and tags still attached), excluding the delivery fee.\n\nThe refund will be made via UPI to your bank account.\n\nOnce we have received your return, we will send you an email confirming receipt of the parcel and process your refund.\n\nRETURNS & REFUNDS (STORE PURCHASES)\n\nWe are happy to exchange or return any item(s) purchased within any H&M India store within 15 days of the original purchase, provided they are in a resalable and unused condition, accompanied by original price tags and receipt\n\nRefunds will be issued in the original form of payment at any of our H&M stores in India. Refunds to credit/debit cards can take up to 30 days to process, please carry the card used for making the payment to the store. If you don’t receive your refund within this time, please contact your bank.\n\nAt this time, we are unable to process returns in our stores for items purchased online.\n\nFor reasons of hygiene, underwear, swimwear, pierced earrings and cosmetics are not eligible for refund or exchange.\n\nPlease note that fabric face masks cannot be returned due to safety and hygiene reasons.\n\nWe accept the following credit and debit cards in our stores: RuPay, American Express, MasterCard, Electron, Maestro and VISA.\n\nDO YOU OFFER EXCHANGES?\nWe don’t currently offer an exchange service. If you would prefer items in another colour or size, please just return the items you don’t need and place a new order on hm.com. \nI did not receive a return form, what should I do?\nDon’t worry, we are no longer including a paper return form in online orders! You can instead register your return online here using the instructions shown above. \n\n \n\nFor our Terms & Conditions, click here.\n"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/shopping-at-hm/online-shopping.html?srsltid=AfmBOoqWzU9hh3stC2odBjp7MSDS1e5jBtahH_gnX7IvaAtCwztCEDaQ",
      "title": "Online Shopping at H&M | FAQs & T&Cs",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/Shopping at H&M/Shopping Online\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nSHOPPING ONLINE\n\nShop at H&M when, where and how you want to!\n\n \n\nLOCATE GARMENTS\nVISUAL SEARCH\nSCAN\nORDERING ONLINE\nARE YOU NEW TO ONLINE SHOPPING?\nARE YOU READY TO CHECKOUT?\nCAN I CANCEL OR AMEND MY ORDER?\n\nFor our online shopping terms & conditions click here. \n\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/h-m-club/h-m-club-terms-conditions.html?srsltid=AfmBOorR4QxYc6CWcRGrpDIvTaK_yo9mgeWcMXxAfkTDOzYjkBPXtfJf",
      "title": "H&M Membership Terms & Conditions",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/H&M Membership/H&M Membership Terms & Conditions\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nH&M MEMBERSHIP TERMS & CONDITIONS\n\n1. INTRODUCTION\n\n\n1.1 Welcome to the loyalty program of H&M Hennes & Mauritz GBC AB, with number of registration  556070-1715 and registered seat at Mäster Samuelsgatan 46 A, 111 57 Stockholm Sweden (\"Loyalty Program\"). By becoming a member you agree to be bound by these Terms and Conditions. \n\n\n1.2 The membership is free of charge and no purchase is necessary to become a member.\n\n1.3 By being a member of the Loyalty Program you will be able to earn points which qualifies you to different tiers where you can take part of offers, services, events and much more organised by H&M or H&M partner companies. The membership will give you a tailor-made experience of the H&M brand including personalized offers and recommendations distributed via email, in app messaging or in your social media feed when applicable. As a member you will  be able to access your purchase history in your membership account (\"My Account\") and when placing items in your shopping bag online we will save the items there between your visits. Please note that items stored in the shopping bag will not be reserved for you and may sell out. You will find more information about current offers under My Account at hm.com.\n\n1.4 .You can find information regarding how H&M will process your personal data in the Privacy Notice here.\n\n2. MEMBERSHIP\n\n2.1 The membership is limited to individuals that are acting in a personal capacity and not in the capacity of a company, who have a current and valid email account and is at least 18 years old. Employees, officers, directors, agents and representatives of H&M are eligible for membership but may be excluded from certain promotions.\n\n\n2.2 By submitting your application, you represent that you are of at least the age to be considered an adult by local legislation in your province or territory of residence and that you agree to these Terms and Conditions. \n\n2.3 Your membership is personal, non-transferable and subject to these Terms and Conditions as well as any other rules, regulations, policies, and procedures adopted by H&M as approved by you upon taking part of offers, rewards, making purchases and other related services. We apply a limit of one membership per person. \n\n\n2.4 Companies, groups, associations or other entities, or others making commercial or bulk purchases are not eligible for membership. The membership may not be used for reselling or profit. \n\n\n2.5 It is your responsibility, and a condition for your membership, to keep your email and contact details up to date. \n\n2.6 After submitting your application, you will need to set up an account, and create a password for that. Please safeguard your password at all times.\n\n2.7 Your Membership is established for an indefinite period of time until your account is cancelled.\n\n3. H&M LOYALTY PROGRAM IN INDIA\n\n\n3.1 The membership is a national program and limited to purchases in H&M-, and H&M HOME-stores, as applicable and online at hm.com in  India. You can only earn points by shopping or by performing other point awarding activities in India as communicated from time to time by H&M. Please note that you will not earn points on purchases of gift cards.\n\n\n3.2 The points you have earned are personal and cannot be transfered to another person or member.\n\n3.3 The points earned on a purchase of an item will be deducted from your account if you return the item. \n\n3.4 To receive points you must provide the Member ID associated with your membership to the sales associate at a H&M or H&M HOME store, as applicable, or sign into My Account before making your purchase. You may view your balance at any time by visiting My Account on hm.com.\n\n3.5 The points earned on a purchase of an item will be deducted from My Account if you return the item.\n\n3.6 To receive points you must provide the Member ID associated with your membership to the sales associate at a H&M or H&M HOME store, as applicable, or sign into My Account before making your purchase. You may view your balance at any time by visiting My Account.\n\n4. POINTS, TIERS AND VOUCHERS\n\n\n4.1 The points you earn counts toward the second tier membership as well as toward bonus vouchers. \n\n4.2 The date when you become a member will constitute the “Start Date” of each “Membership Year”. The “Membership Year” is the 12 months following the Start Date of each year. The tier level of your membership is based on the points earned during the current or previous Membership Year whichever is the highest. If you are a new member, or do not have sufficient points to qualify you to the second membership tier level, your membership tier level will start at the first tier. If you reach the second tier during a Membership Year you will stay at the second membership tier level during the rest of the Membership Year and the following Membership Year. If you during the Membership Year do not accumulate sufficient points to qualify you to the second membership tier level, you will return to the first tier for the following Membership Year. \n\n\n4.3 After the end of each Membership Year all points counting towards the next membership tier level will be reset and start over at 0 at the beginning of each Membership year.\n\n4.4 The points counting towards the bonus voucher are valid until the next Start Date.\n\n4.5 When you have earned [200] points, a bonus voucher [of Rs.300] will be issued in your app or on My Account. You can use the bonus voucher both in H&M-, H&M HOME-Stores, as applicable, and online.\n\n4.6 The bonus voucher will be issued 30 days after the date that the sufficient point limit is reached. You can only obtain [5] bonus vouchers per calender month, and a maximum of [20] bonus vouchers per 12 month period.\n\n4.7 Bonus vouchers cannot be exchanged for cash, gift cards or used for purchases that totals an amount less than the value of the bonus voucher.  The sum total of the purchase, after the bonus voucher is applied, must exceed 1 [Re/currency unit]. Non-Commercial goods, such as shopping bags in store, does not count towards this sum.\n\n4.8 Each bonus voucher is only redeemable once and is applied on all articles in the order. The discount is split between the articles so that the discount share per article remains the same for all articles in the order. The respective reduction of the individual articles of a purchase remains, even if some articles of the purchase are returned. The discount advantage of the bonus checks is not redistributed to the remaining articles of the order.\n\n4.9 In the case of a return, the discount advantage received through the bonus voucher (value of the bonus voucher) expires. Only the amount paid for the article will be refunded, not the savings from the bonus voucher. If you activate the bonus voucher in an H&M- or H&M HOME-store, as applicable, the bonus voucher must be redeemed at the checkout within 15 minutes after activation, otherwise it will be irretrievably deleted and expire. Printouts or screenshots of the bonus voucher will not be accepted. Legal recourse is excluded.\n\n4.10 The bonus vouchers cannot be used to purchase H&M Gift Cards, or be applied to past purchases.\n \n\n5. CHANGES, TERMINATION AND/OR REMOVAL FROM H&M LOYALTY PROGRAM \n\n\n5.1 You may cancel your membership at any time through My Account on hm.com or by contacting customer service. Please note that cancelling your membership means that you will only be able to shop at hm.com using the guest check-out.\n\n5.2 If you cancel your membership any points which remain in My Account will be forfeited.\n\n5.3 H&M may, at its sole discretion, terminate, alter, limit, suspend or modify the Loyalty Program, and/or the Terms and Conditions at any time, in case of changes to applicable laws, changes in services provided by H&M or introducing new services. Any such change will take effect after fourteen (14) days from the date on which you have been informed of such change either in the app, online, via mail or a combination thereof. If you do not accept the changes you have the right to cancel your membership.\n\n5.4 H&M reserves the right to make minor changes to the Loyalty program and its Terms and Conditions without providing you with prior notification, provided that these changes does not affect the membership in a negative way. Please make sure to stay updated on the Terms and Conditions. You will always find the latest version of the Terms and Conditions on hm.com.\n\n5.5 Any violation of the H&M Loyalty Program rules, proven or probable fraud, non-compliance with the Terms, inactivity on the account, provision of incorrect data or any act detrimental to H&M's interests may lead to termination of, and/or affect your ability to participate in, the H&M Loyalty Program, including, but not limited to, the adaptation of payment methods. If your participation in the program is cancelled, all points shown on the My Account page will automatically expire.\n\n5.6 We reserve the right to adapt payment methods and/or terminate or restrict access to accounts for the following reasons. Reasons for payment method adaption, termination or restriction may include, but are not limited, to the following: (1) Abnormal frequent and / or high number of returns; (2) Behaviour demonstrating clear intent to resell and / or make a profit by purchasing our products; or (3) Multiple accounts and / or registration of a new account by previously suspended users. We also reserve the right to cancel orders made when shopping as a guest for the same reasons. If your access has been restricted or order cancelled and you think we’ve made a mistake, please get in touch with Customer Service. \n\n6. LIMITATION OF LIABILITY\n\n\n6.1 H&M will not be liable for any system failure or malfunction of the Loyalty Program or any consequences thereof. H&M accepts no liability for any loss or damages arising from suspension, variation or termination or in any other way relating to the Loyalty Program, except for any liability which cannot be excluded by law. \n\n6.2 H&M will not be liable for the misuse of My Account resulting from unauthorized access by third parties.\n\n7. APPLICABLE LAW AND JURSICTION\n\n\n7.1 These Terms and Conditions shall be governed by the laws of India, without regards to any rules or principles on conflicts of laws. Any dispute, claim or controversy arising or relating to these Terms and Conditions or membership shall be resolved by the applicable courts in India, unless otherwise stipulated in applicable mandatory consumer protection laws.\n\n7.2 If you have a problem with the Loyalty Program, and are not able to settle the  issue with H&M, then you can submit your complaint to the EU’s online dispute resolution platform (the “ODR platform”). \n\nThe ODR platform offers consumers and traders within the EU with the possibility to try and reach an out-of-court settlement for complaints arising from online purchases. This single entry point is designed to be a user-friendly and interactive website, available in all EU official languages and free of charge. Using the ODR platform the consumer and the trader can find a dispute resolution body and then go through the process of finding a solution to the consumer’s complaint. The ODR platform is available here: http://ec.europa.eu/odr\n\n8. CONTACT US\n\n8.1 If you have any questions regarding the Loyalty Program you may contact customer service at H&M on 1800-889-8000 (free of charge). All correspondence regarding the Loyalty Program should be addressed to Customerservice.in@hm.com\n\n2023-09-27\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/member/info.html?srsltid=AfmBOopqagSURQJBsPu__gIk9hteZzyunMEvXYGuGtyrAvFnvJJBzc4u",
      "title": "H&M Membership | Join to Collect Points & Rewards",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nIt pays off to be a member\n\nEnjoy special member perks and exclusive experiences. It’s free, and you get 10% off your first purchase.\n\nJoin nowRead more\nAll your benefits\n\n0-799 points\n\n800 points\n\n10% off one purchase when you join\nMember\nPlus\nCollect points when you shop Rs.50 = 1 point\nMember\nPlus\nBonus vouchers 200 points = Rs 300.00 voucher\nMember\nPlus\nOffers and discounts\nMember\nPlus\nFree returns\nMember\nPlus\nSpecial member prices\nMember\nPlus\nPre-Access to sale\nMember\nPlus\nInvitations to events\nMember\nPlus\nBenefits from collaborating partners\nMember\nPlus\nExciting contests\nMember\nPlus\nFree delivery\nPlus\nSurprise Plus offers\nPlus\nUnique access to special collections\nPlus\nExclusive experiences\nPlus\n15% off on one purchase on your Birthday\nView more\nHow it works\nSign-up\n\nAll you have to do is sign up — it's free! The membership is completely digital. Explore all the perks at hm.com or in the H&M app.\n\nJOIN NOW\nCollect points\n\nCollect points when you shop Rs.50 = 1 point and by making conscious choices.\n\nHow to collect points\nRedeem rewards\n\nOur way of giving back — get bonus vouchers and other offers through some of our collaborating partners.\n\nBecome a Plus member\n\nReaching 800 points makes you a Plus member and gives you access to even better perks and offers.\n\nFAQ\nWhat would you like to know?\nWhat do I need to know before signing up to the H&M Membership?\nHow do I collect points?\nIs there a membership fee for Hello Member?\nWhere can I find my rewards?\nHow do Bonus vouchers work?\nWhy haven't I received my Bonus voucher yet?\nFor how long is my Bonus valid?\nFor how long are my points valid?\nWhen do I reach Plus level?\nHow long will I keep the Plus status?\nWhere can I find my receipts?\nHow do I get my Welcome offer?\nWhere can I find my member card?\nCan I use my membership abroad?\nHow are you handling my personal information (GDPR)?\nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs.\n\nBefore you start shopping\nWe use first- and third-party cookies including other tracking technologies from third party publishers to give you the full functionality of our website, customize your user experience, perform analytics and deliver personalized advertising on our websites, apps and newsletters across internet and via social media platforms. For that purpose, we collect information about user, browsing patterns and device.\n\nBy clicking “Accept all cookies”, you accept and agree that we share this information with third parties, such as our advertising partners. Click on “Cookie settings” to customize your options. Visit our Cookie policy to learn more.\n\nCookie policy\nAccept all cookies\nCookie settings"
    },
    {
      "url": "https://www2.hm.com/en_in/member/offers/bonus.html?srsltid=AfmBOorrhACkdBHB0bQej9p3nUsXuRJfM0nvaG3377-pOk4uh8HyohCp",
      "title": "bonus",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\n\nBonus\n\nYou've earned it! Get Rs.300 off your next purchase.\n\nStarts on\n\nValid until\n\nYou cannot redeem this voucher while another one is active. Please mark the active voucher as used first.\n\nRedeem online\nREDEEM VOUCHERS IN-STORE USING OUR APP. GET THE H&M APP NOW!\n\n \nCONGRATULATIONS! YOU'VE EARNED A NEW BONUS VOUCHER AND YOU CAN SPEND IT EITHER ONLINE OR IN STORE. HAPPY SHOPPING!\n\nHOW:\n\nTo use your Rs.300 Reward:\n\nRedeem in store: \n\n\n1. Click on the My Account tab to browse through all available offers.\n\n2. Click on the offer you would like to use.\n\n3. Activate the offer and show your smartphone to the cashier. \n\n4. You have 30 minutes after activating the offer to use the discount. \n\n5. You're done!\n\n \n\nRedeem online:\n\n1. Click on the My Account tab to browse through all available offers. \n\nYou can choose your reward or offer before your start shopping (or at the online checkout).\n\n2. Choose your favorite styles at hm.com or the H&M App and proceed to checkout. \n\n3. It's that simple! Your offer or reward is automatically applied to your shopping bag!\n\nYou can use the voucher both in H&M and H&M HOME Stores and at HM.com. Vouchers are valid for 2 months. You can only obtain 5 vouchers per calendar month, and a maximum of 20 vouchers per 12 month period. Vouchers cannot be exchanged for cash or used for purchases that totals an amount less than the value of the voucher. The sum total of the purchase, after the voucher is applied, must exceed Rs.300 . Non-Commercial goods, such as shopping bags in store, does not count towards this sum. The vouchers cannot be used to purchase H&M Gift Cards. A discount is given to each item in your purchase to make up the Bonus amount, which means if you return one or several items you will be given a refund for the purchase amount for each item. Bonus' will not be refunded for a return.\nHOLD ON… PRE-SALE WILL START SOON.\n I will not join this Pre-sale. Maybe next time.\nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs.\nBefore you start shopping\nWe use first- and third-party cookies including other tracking technologies from third party publishers to give you the full functionality of our website, customize your user experience, perform analytics and deliver personalized advertising on our websites, apps and newsletters across internet and via social media platforms. For that purpose, we collect information about user, browsing patterns and device.\n\nBy clicking “Accept all cookies”, you accept and agree that we share this information with third parties, such as our advertising partners. Click on “Cookie settings” to customize your options. Visit our Cookie policy to learn more.\n\nCookie policy\nAccept all cookies\nCookie settings"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/smsinfo.html?srsltid=AfmBOoqbGMEegYpMiUV2XF7DIUplmgR80SPtnZRbokhAJIAgSiWT6shY",
      "title": "SMS Info",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/SMS Info\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nSMS INFO\n\nIf you are 16 years old or older and wish to receive marketing messages, please text AGREE and your email address to 013-3366-5662. \n\nMessage and Data rates may apply. If you agree, you will receive one (1) text message from H&M in response to your enrollment. Your agreement to these terms for receiving marketing messages is not a condition of purchasing any H&M products. Your text to 013-3366-5662 is your electronic signature signifying your agreement to these terms. In reward you get 20% off one item, an offer collected at the cashier and valid in-store on the day of your sign-up only and not valid with other offers or with select special collections. \n\nShould you need help contact us by email at info.kr@hm.com. \n\nYou can also contact us at \n\nH & M Hennes & Mauritz Ltd.\n15th Floor OCI Building,\n94 Sogong-Ro, Jung-gu,\nSeoul 100-718\nSOUTH KOREA.\n\nIf you wish to stop receiving messages from H&M text STOP to 013-3366-5662 for instructions. You can unsubscribe from receiving further emails from H&M at any time via the \"Unsubscribe\" link present at the bottom of each marketing e-mail.\n\nH&M will process your personal information only if you submit your e-mail address and consent to us processing your personal data. H&M Hennes & Mauritz AB in Sweden is the controller for the personal data you provide us with and the personal data is electronically transmitted immediately after your consent is provided and is stored in the EU and will be used to provide you with marketing information untill the purpose is achieved. We do not pass on or sell your data to third parties for marketing purposes outside the H&M Group. You can object to the use of your personal data at any time. Find our Privacy Policy in full here. [Link to the local Privacy Policy]\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/returns.html?srsltid=AfmBOopy6stoCL_GV0Yp-7yTBfat0eeb056cV-WwwpM6bqNzAZ-D9yTA",
      "title": "Return Policy & Methods | Refunds & Exchanges",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/Returns\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nRETURNS\n\n \n\n \n\nONLINE RETURNS\n\nLog in to our returns portal with your order number (it's in the order confirmation email) and the email address you used when you placed the order; and let us know what you want to return and why. \n\nThe return request must be raised with us within 15 days from the date you receive your parcel.\n\nRegister a return\n\nOnce you've registered your return via the portal, follow the instructions on how to send your return shipment. You can track your return via our track & trace page link shared in the Return pickup email, and once we received it we’ll email you.\n\n \n\nHOW TO MAKE A RETURN (ONLINE PURCHASE)\nONLINE RETURNS – FREQUENTLY ASKED QUESTIONS\nREFUNDS PAY ON DELIVERY (ONLINE PURCHASES)\nREFUNDS CARD (ONLINE PURCHASES)\nREFUNDS UPI (ONLINE PURCHASES)\nRETURNS & REFUNDS (STORE PURCHASES)\nDO YOU OFFER EXCHANGES?\nI DID NOT RECEIVE A RETURN FORM, WHAT SHOULD I DO?\n\n \n\nFor our Terms & Conditions, click here.\n\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/return-link.html?srsltid=AfmBOoqpSZ3lpcmvVCCEPUVU6ERq0FqOS49Cy7toMkXwNSaIgexmTRXY",
      "title": "Online Returns",
      "content": "RETURNS\n\n \n\n \n\nOnline returns\n\nLog in to our returns portal with your order number (it's in the order confirmation email) and the email address you used when you placed the order; and let us know what you want to return and why. \n\nThe return request must be raised with us within 15 days from the date you receive your parcel.\n\nRegister a return\n\nOnce you've registered your return via the portal, follow the instructions on how to send your return shipment. You can track your return via our track & trace page link shared in the Return pickup email, and once we received it we’ll email you.\n\n \n\nHOW TO MAKE A RETURN (ONLINE PURCHASE)\n\nHOW TO MAKE A RETURN\n\n\nReturns are free of charge.\n\nPlease keep in mind that online purchases must be returned via mail and cannot be returned in our physical stores. The return must be sent to us within 15 days from the date you received your parcel.\n\nSwimwear, underwear, pierced earrings, cosmetics and face masks cannot be exchanged & refunded due to hygiene reasons.\n\nH&M HOME items purchased online cannot be returned in our stores and must be returned through our returns portal only. To ensure successful return pick-up, please return the product in the same packaging as received.\n\nYou can easily return items by following these steps:\n1. Let us know which items you wish to return by registering your return online here. All you need is your order number & your registered email address and you can arrange collection of your return. \n\n2. Package the items you wish to return in a suitable bag or box, eg. the one you received your parcel in. Registering your return online means you don’t need to include any paperwork in your parcel.\n\n\n3. A courier from carrier partner will attach the return label on your parcel upon collection.\n\n\n4. The courier will provide you with proof of return. Please keep this for your records.\n\n\nIf you have received your order in two separate packages and need to make a return you can proceed in the same way by requesting a return digitally through our website or app.\n\nOnce we have received your return shipment in our warehouse, we will send you an email confirming receipt of the parcel. Please allow up to 14 days for this to happen. If you don’t receive the email within 14 days, please contact us.\n\n\n\nOnline Returns – Frequently asked questions\n\nWhat is Digital Returns?\nDigital Returns is a seamless process to book the returns digitally by simply visiting our H&M website under customer service return page.\n\nWhere can I find a link to Digital Return?\nYou will find the link to Digital return on our H&M website under customer service return page, in your order shipment email or you can simply click on the order under Myaccount to view the link for return. Additionally there is a QR code available in the hard copy Invoice received in your parcel which you can scan to view the link for Digital Return.\n\nWhat is the return timeframe?\nThe return request must be raised with us within 15 days from the date you receive your parcel.\n\nMy order was delivered in two packages, how do i proceed with my return?\nIf you have received your order in two separate packages and need to make a return you can proceed in the usual way by requesting a return digitally through our website or app.\n\nShowing an error while booking the return?\nEnsure you have cleared Cache and Cookies from your Browser and make sure you have entered the right order no and email address you used when you placed the order. If the issue still persist than contact Customer Service for further assistance \n\nCan I return part of my order?\nYes – You can return any item from your order.\n\nWhat details do I need to register a return digitally?\nIn order to register your return digitally, you will need to have an order no and email address you used when you placed the order.\n\nCan I change the mode of payment of my refund?\nNo – Refund will be made to the original mode of payment.\n\nFor pay on delivery orders please ensure your bank details are listed in your H&M account so we can refund the balance directly to your bank account. No cash refunds. \n\nDo I need to have a return label for returning an item digitally?\nNo – The Digital return is completely paperless and requires no return label.\n\nHow can I cancel my registered return?\nYou can cancel your registered return by simply following the link provided in your return confirmation email.\n\nHow many times a courier will make the attempt to collect my parcel?\nA courier will have a maximum of two attempts to collect your parcel, failing on 2nd attempt will auto cancel your registered return.\n\nHow can I view the status of my return parcel?\nYou can simply refer to your return confirmation email and click on 'track my return' or you can contact our Customer Service team.\n\nHow can I return incorrect item or faulty item?\nYou can return any incorrect item or faulty item by following the normal return procedure upon selecting the correct reason.\n\nHow can I return a wrong parcel?\nPlease contact Customer Service for the assistance.\n\nWhat all can I return?\nYou can return any item.  Swimwear, underwear, pierced earrings, cosmetics & fabric face masks cannot be exchanged & refunded due to hygiene reasons\n\nREFUNDS PAY ON DELIVERY (Online purchases)\n\nWe will refund within a period of 30 days from the date we receive the items you return (with labels and tags still attached), excluding the delivery fee.\n\nPlease ensure your bank details are listed in your H&M account so we can refund the balance directly to your bank account. No cash refunds.\n\nNote: Even if the courier accepted card or other non-cash payment upon delivery, we will still refund the balance to your bank account.\n\nOnce we have received your return, we will send you an email confirming receipt of the parcel and process your refund.\n\nREFUNDS CARD (ONLINE PURCHASES)\n\nWe will refund within a period of 30 days from the date we receive the items you return (with labels and tags still attached), excluding the delivery fee.\n\nIf you paid by card, we will issue your refund to the same card used when making the purchase.\n\nOnce we have received your return, we will send you an email confirming receipt of the parcel and process your refund.\n\nNote: Refunds can only be made to the original mode of payment.\n\nREFUNDS UPI (ONLINE PURCHASES)\n\nWe will refund within a period of 30 days from the date we receive the items you return (with labels and tags still attached), excluding the delivery fee.\n\nThe refund will be made via UPI to your bank account.\n\nOnce we have received your return, we will send you an email confirming receipt of the parcel and process your refund.\n\nRETURNS & REFUNDS (STORE PURCHASES)\n\nWe are happy to exchange or return any item(s) purchased within any H&M India store within 15 days of the original purchase, provided they are in a resalable and unused condition, accompanied by original price tags and receipt\n\nRefunds will be issued in the original form of payment at any of our H&M stores in India. Refunds to credit/debit cards can take up to 30 days to process, please carry the card used for making the payment to the store. If you don’t receive your refund within this time, please contact your bank.\n\nAt this time, we are unable to process returns in our stores for items purchased online.\n\nFor reasons of hygiene, underwear, swimwear, pierced earrings and cosmetics are not eligible for refund or exchange.\n\nPlease note that fabric face masks cannot be returned due to safety and hygiene reasons.\n\nWe accept the following credit and debit cards in our stores: RuPay, American Express, MasterCard, Electron, Maestro and VISA.\n\nDO YOU OFFER EXCHANGES?\nWe don’t currently offer an exchange service. If you would prefer items in another colour or size, please just return the items you don’t need and place a new order on hm.com. \nI did not receive a return form, what should I do?\nDon’t worry, we are no longer including a paper return form in online orders! You can instead register your return online here using the instructions shown above. \n\n \n\nFor our Terms & Conditions, click here.\n"
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service/legal-and-privacy/terms-and-conditions.html?srsltid=AfmBOorPVD0DILL9MMyRc02xPuH7l5Baxe8VPD6nMkcYOxT-oWXc2uqE",
      "title": "Terms & Conditions | Online Store",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service/Legal & privacy/Terms & Conditions\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nTERMS & CONDITIONS\n\n\n1. General\n\n1.1 Hey H&M friend, welcome to our terms and conditions! We are so happy you've made it here. This may not be the most exciting document you'll ever read, but it is important to establish what you can expect from us and what we expect from you. And just to be clear, when we say \"us\", \"we\" or \" H&M\", we mean H&M Hennes & Mauritz Retail Private Limited .\n\n1.2 These terms and conditions apply when you place an order with us via the website www2.hm.com, or our mobile application the H&M App (from now on referred together to as the \"Online Store\").\n\n1.3 By placing your order you agree to be bound by these terms and conditions, or the \"Terms\" as we will call them from now on. Therefore, please make sure you have read and understood them before ordering. \n\n1.4. Only persons who can enter into legally binding contract under the Indian Contract Act, 1872 can use and/or transact on the Online Store. Also, meaning that you must be at least 18 years old or above. If you are under 18 years, you may use and/or transact on the Online Store only with the involvement of a parent or a guardian. You must also have a valid email address and a delivery address in India. \n\n1.5 You may not place an order for corporate, commercial or self-employed activities. We do not issue commercial  Goods and Services Tax (GST) invoices for corporate use.\n\n1.6 H&M wants to provide the best possible online experience. To make this possible we need to ensure that our services runs like a clockwork. You understand and agree not to (i) post, transmit, redistribute, upload, or promote any communications or content that could harm or negatively impact our business, products or services; (ii) act in a manner or employ any device that restricts, impairs, interferes or inhibits any other user from using or enjoying the hm.com site, or which impacts the security of the site, or (iii) employ any device or attempt to use any engine, software, tool, agent, script or other device or mechanism (including without limitation spiders, bots, crawlers, avatars or intelligent agents) to navigate or search the site, or to copy content from the site. We reserve the right to immediately bar access to the site and close the account of a user who violates any of the provisions of these terms and conditions or whose acts, as per H&M’s understanding, are detrimental to the interests of H&M in any manner. \n\n1.7 H&M sells its products directly through Online Store and online marketplace (collectively referred to as “Authorized Online Stores”) and not through any other third party(s) or agent(s). You may please contact our Customer Service if you wish to know further details on the Authorized Online Stores.  \nH&M does not control, endorse or accept responsibility for any products proposed to be sold or offered to be sold or purchased on the website or any linked sites other than the Authorized Online Stores. H&M makes no representations or warranties whatsoever about and shall not be liable for any transaction through such third partie(s) or agent(s) including representations relating to merchantability, fitness of a product or service for a particular purpose, warranty as to specific products and non-infringement of third party intellectual property rights. Any transactions that you may have with such third partie(s) or agent(s) are at your own risk. H&M also does not accept any responsibility for the usage of the products, fraudulent or illegal activities, non- payment, delivery of the products purchased by you from such third partie(s) or agent(s) .\n\nH&M specifically disclaims any liability with regard to any infringing, illegal,  fake, spurious, duplicate, counterfeit or defective, refurbished products purchased by you from such third party.\n\n\n1.8 We have the right to amend these Terms, but the Terms that you approve at the time of your purchase will always apply for that particular purchase. Any changes made will be included in the latest published version of the Terms in the Online Store. Changes to the Terms will be effective from the time you accept the Terms, i.e. in connection with you making a new purchase. This means that we might and probably will change our Terms every now and again, so keep on visiting this page to stay up to date. \n\n \n\n2.Prices and delivery charges\n\n2.1 The prices displayed in the Online Store include the applicable statutory tax  /Goods and Services Tax (GST), but do not include delivery charge. In the checkout view, the total cost for your purchase including delivery charge will be displayed.\n\n2.2 Please note that prices in the Online Store can differ from prices in our physical stores.\n\n2.3 The cost for delivery is shown in the checkout view. You can also find more information here. Our standard delivery fee is Rs. 149. If we are unable to deliver your order in full and must make more than one delivery, you will only be charged for the single delivery.\n\n2.4 We may from time to time offer promotions, discount codes, gifts and other offers. Such offers are valid only for the period specified in connection with such offers and on the terms directly associated with them. Offers cannot be combined with other discounts unless expressly stated otherwise in the Online Store. You need to fill in the discount code for the offer before completing the purchase in order to use the offer.\n\n\n3. Ordering\n\n3.1 Do you want to place an order? Great! This is how you do it. You collect the items you wish to order in your shopping bag using the “Add to bag” button. In the shopping bag view, you can review your order and remove any item you have changed your mind about before proceeding to the checkout. When you place your order by clicking the “Complete purchase” button, you are making a binding offer to purchase the items in the shopping bag. Depending on your selected payment method, further steps may be required to finalise your payment.\n\n3.2 On receipt of your order, we will send you an automatic email confirmation that your order has been placed. Please note that a placed order is an offer and does not constitute a binding contract until the order has been approved by us. If we approve your order, we will send you a shipping confirmation email that includes all relevant information about your order and its delivery. The shipping confirmation email is our approval of your order and the conclusion of our contract. Yay!  \n\n3.3 For various reasons, we may not be able to approve your order. We reserve the right to not approve your order for any 3.3.a. operational, 3.3.b. legal, or 3.3.c. commercial reason. For example, this could be the case if the item you ordered is defect and we have no more items in stock, or in case we suspect that items are being ordered for commercial reselling purposes. If we are unable to approve your order, we will let you know at the earliest opportunity after the automatic email confirmation has been sent, but naturally before we approve your order and send you the shipping confirmation.\n\n3.4 If we have already received payment for an order that is not approved by us, we will attempt to refund the applicable amount using the same method you used to make the payment. If alternative arrangements are necessary for any reason, we will contact you to settle the refund.\n\n \n\n4. Payment methods\n\nYou can pay for your goods in various ways as set out below. Depending on the payment method you choose, additional costs and terms may apply.\n\n\n4.1 Payment before or at delivery\n\nCredit card or debit card\nYou can enter your payment details at the time you place your order using a valid credit or debit card (VISA ,Mastercard,Rupay or such other option(s) as offered at our Online Store). The applicable amount will immediately be debited from your card. H&M reserves the right to check the validity of the credit or debit card, its credit status in relation to the order value and whether the address data of the purchaser is correct. We may refuse orders depending on the result of these checks.\n\nCash on Delivery\nYou may choose to pay by cash on delivery upon receipt of the goods, without any additional charges.\n\nEMI\nYou may choose EMI as a payment method provided by various banks. Additional interest charges are applicable depending on the tenure and amount involved.\n\nUPI \nYou may choose to pay your order with UPI. The order value will be debited from the associated bank account when you have placed your order at the checkout page.\n\nNET BANKING\nYou may choose to pay for your order via net banking. The order value will be debited from the associated bank account when you have placed your order at the checkout page.\n\n4.2 Other\nYou will receive your receipt/tax invoice in the order delivered e-mail as well as in the order package delivered to you.\n\n4.3 You are requested to see our Privacy Policy to see how your personal information will be used and stored\n\n\n5. Delivered\n\n5.1 So, when will my order arrive, you wonder? In the checkout view, before placing your order, you will be informed of the  estimated delivery time following our approval of your order. You can also find more information at Delivery Policy . If we approve your order, you will receive a shipping confirmation email containing all relevant information about your order. \nFor delivery of products such as larger rugs and furniture from our external H&M HOME range, please allow 5-14 business days. You can find our full shipping and delivery policy here.\n\n5.2 Even though we do our very best to deliver within the communicated time frame, delivery may sometimes take longer due to unexpected events. If your order does not arrive by the estimated time of delivery, please contact Customer Service and they will try their best to help you.\n\n5.3 Sometimes life gets in the way, and you forget to respond to the carrier. That's fine, we've all been there. However, if your order cannot be delivered after 3 attempts, the order shall be returned back to origin. No cost of return will be charged to you. Subsequently, your order amount will be automatically refunded to you in the original form of payment. \n\n5.4 H&M reserves the right of not delivering the order to you in case of force majeure events, political unrest or other unforeseen circumstances.  \n\nIn case a delivery is temporarily not possible for your location or pin code on account of factors mentioned hereinabove, then your order will not be placed on our Online Store, and you will be notified of the same.\n\nWhereas in cases where your order is successfully placed on the Online Store  and subsequently your location or pin code becomes temporarily unserviceable, and incase the order has already been picked up by the delivery partner, then the delivery partner will attempt delivery with extended timelines if the specific dates for delivery are clearly available. However, if there are no specific timelines available, then the parcel will be returned to the origin and the refund process will be initiated.\n\nIn case your order is placed and if your location or pin code is not serviceable before the order has been packed, then H&M will cancel your order and notify you through email and a refund shall be initiated to you upon such cancellation. \n\n\n6. Returns\n\n6.1 Changed your mind? No problem. You have the right to return any or all items in your order for any reason at all, by notifying us and returning the items within 15 days after your receipt of the order.\n\nYou can return your order by simply placing a return request on the Online Store.\n\nYou can go to My Orders on Your account page, then click on the order you want to return, select the item to be returned and submit the request. After that, please place the item you wish to return in the parcel the item was received in and hand it over to the delivery person assigned to carry out the pick-up.\n\nIf you want to arrange for the return of your item in an alternative manner, then please contact Customer Service. \n\n6.2 Please include the correct and complete item in the parcel, otherwise we  will not be able to process your return. We want to highlight that you can only return items purchased from  the Online Store. You cannot return/ include items purchased from our physical stores in the parcel. \n\n6.3 If you choose to make a return, we will refund you the order value except the cost of delivery. Furthermore, should you choose to keep certain items and only return parts of your order, the delivery cost will not be refunded.  \n\n6.4 The refund will be made to the same payment method you used to place the order, within 30 days of us receiving the items back. If you have not received your refund within 30 days, please contact Customer Service and we will help you.\n\nRead more about our Return/refund policy on hm.com\n\n6.5 We will give you a full refund for any returned item provided that it is returned in the same condition as it was in upon your receipt. If an item in any way has been damaged, soiled, washed, altered or worn (other than to try the item on) and the value of the item has been reduced, in such cases we offer no refund. \n\n6.6 The right of withdrawal and return does not apply to products which are unsuitable for return, such as certain underwear, swimwear, piercing Jewellery, face masks, beauty products and cosmetics due to health protection or hygiene reasons.\n\n6.7 For more information about returns, click here  hm.com\n\n\n7. Defects\n\n7.1 If there are defects in the goods you have purchased, H&M abides by all statutory regulations. If you have a complaint regarding obvious material or manufacturing faults in goods that we have supplied, including damage incurred in transit, please let us know by returning the goods to us by initiating the return process under the Returns section on hm.com \n\n\n7.2 If an item you have received is defective and you notice the defect within 15 days after your receipt of the item, you may choose to follow the instructions in section 6 (Returns). Please select the option “Defective/Broken Item” while placing a return request on the Online Store. \n\n\n8. Our liability\n\n8.1 All reasonable efforts are made to ensure that information in our Online Store is accurate, complete, and current at the time of uploading on the Online Store. Despite our best efforts, information may occasionally be inaccurate, incomplete or out of date. Hence, we do not guarantee the accuracy of the Information and to the extent permitted by applicable law, H&M disclaims all representations and warranties, express or implied, that content or information displayed in or on the Online Store is accurate, complete, up-to-date and/or does not infringe the rights of any third-party. \n\n8.2 We do our best to accurately display and describe the attributes of our products in the Online Store regarding measurements, composition and colours. \n\nHowever, the colour you may see depends on your device. Our measurements are only approximate values to better estimate the model or fit of that specific item. It is not a guarantee of the actual measurements of the item you receive since the final measurements may vary depending on the material used in its production. If you are not satisfied with the item you ordered, you may return the item. Please see section 6 (Returns).\n\n\n8.3 What happens when things go really wrong? In case  an event beyond our control occurs, and which we are not able to reasonably overcome or anticipate, we will no longer have an obligation to fulfil our contract with you. Such an event might include government action or omission, new legislation, labour law conflict, war or danger of war, major disturbance of public order, sabotage, extreme weather conditions, fire, explosion, pandemic, epidemic, virus, and natural disasters. If any of these events occur, we are not obliged to compensate you for any damages. However, in such cases you may contact our Customer Service.\n\n8.4 H&M accepts no liability for any losses or damages which are not reasonably foreseeable arising out of or in connection with these Terms or your use of the Online Store.\n\nYou agree to indemnify and hold harmless H&M and (as applicable) H&M's parent, subsidiaries, affiliates, third-parties and their respective shareholders, officers, directors, agents, and employees, from any losses, liabilities, damages, costs and expenses, claims or demand, or actions including reasonable attorneys' fees asserted against or incurred by H&M, made by any third party arising out of your breach or non-performance of the Terms, or your violation of any law, rules or regulations or the rights of a third party.\n\nNothing in these terms shall exclude or limit H&M's liability with regard to any matter for which it would be unlawful for us to limit or exclude our liability.\n\nH&M accepts liability for death or personal injury caused by our negligence or that of our employees and agents. We do not seek to exclude liability for fraudulent misrepresentation by us or our employees or agents. If we breach these Terms, we shall only be liable for losses which are a reasonably foreseeable consequence of such breach.\n\nH&M is not responsible for indirect losses which are a side effect of the main loss or damage, for example loss of profits or loss of opportunity; or for failure to deliver the goods or to meet any of our other obligations under these Terms where such failure is due to an event that is beyond our reasonable control, which includes but is not limited to fire, flood, storm, riot, civil disturbance, war, nuclear accident and terrorist activity.\n\nOur maximum liability to you for any loss or damage arising in connection with your order on the Online Store  shall be limited to the total price of your order.\n\n\n9. Complaints and dispute resolution\n\n9.1 If you have a complaint regarding any of our products or services, please let us know by contacting Customer Service. Click the link: Customer Service\n\nIn the unlikely event that we are unable to resolve a complaint with you directly, you have the right to refer the dispute to the Grievance Officer.\n\nIn compliance with the Consumer Protection (E- Commerce) Rules, 2020, the details of the Grievance Officer are as mentioned below:\n\nGrievance Officer \n\nName: Mr. Jeetu Wadhwani (Customer Service – India)\n\nEmail Id: grievanceofficer.in@hm.com \nPhone No: 011-66786895\n\nAddress: H&M Hennes & Mauritz Retail Private\nLimited, A wing, 2nd Floor, D3, District Centre, Saket,\nNew Delhi 110017 India\n\nTimings: Monday to Friday 09:00 AM – 06:00 PM\n\n\n9.2 We adhere to all applicable laws including mandatory consumer protection legislation and we have no intention of excluding or restricting such rights you may have through these terms\n\n \n\n10. Severance\nSubject to applicable law, if any clause in these Terms is found to be unenforceable for any reason, this will not affect the enforceability of any other clause in these Terms.\n\n \n\n11.Governing Law and Dispute Resolution \nThese terms and conditions are governed by and construed in accordance with the laws of India. \n\nAny dispute that arises out of or is related to the interpretation of these terms and conditions, shall be subject to the exclusive jurisdiction of the Indian courts in New Delhi, India.\n\n\n12.Assignment\nH&M reserves the right to assign or pledge to third parties any claim(s) for payment which may have arisen in connection with the delivery of goods. \n\n\n13. Communications\nYou hereby consent to receiving communications including news, delivery and return related updates, offers/ campaign related messages from us, to the email address and/or the mobile phone number provided by you. \n\nFurther, by accessing and using the Online Store, you explicitly consent to receive such communications whether through call, SMS, email or through any other digital /electronic means from us and/or our authorized representatives. \n\nYou can at any time unsubscribe/ opt-out from receiving marketing/ promotional communications and our newsletters by following the instructions set out in such communications (if any) or by contacting our customer care.\n\n\n14. Intellectual Property\nAll trademarks, copyright and other intellectual property rights in all content including brand names and logos or software contained on the Online Store, including emails or any other form of communication with you is protected by copyright right laws and shall remain at all times vested in H&M Hennes & Mauritz AB and its subsidiaries or licensors.\n\nYou are permitted to use the content posted on our website only to the extent authorized by H&M. \n\nH&M may provide the functionality to allow you to provide product ratings and reviews (“User Content”) in relation to its products. \n\nIn such a case, you are solely responsible for such User Content, and the customer warrants that any User Content posted by you is accurate and that you are the sole author. \n\nYou hereby assigns to us all intellectual property rights in any User Content posted on the Online Store. H&M reserves the right to remove User Content which in its sole opinion is deemed to be incorrect, offensive, illegal or otherwise unacceptable.\n\n\n15. Company Information\nH&M Hennes & Mauritz Retail Private Limited \n\nRegistered office: A-Wing, 2nd Floor, D-3, District Centre Saket, New Delhi – 110017, India \n\nRegistered number: CIN- U74140DL2013FTC262231 \n\nContact Details: Customer Service\n\nEmail: customerservice.in@hm.com \n\nPhone:1800-889-8000\n\nFree of charge\n\n\n150624\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    },
    {
      "url": "https://www2.hm.com/en_in/customer-service.html?srsltid=AfmBOoofsgnJLf1b6V-Ic6c_7p0teuNxxXodJlsogFnTQ9yTgs90UdD_",
      "title": "Customer Service | Help & Support",
      "content": "Skip navigation\nSustainability\nCustomer Service\nNewsletter\nheader.more.links\nH&M Hennes & Mauritz\nSign in\nFavourites\nShopping bag (0)\nLadiesMenBabyKidsHomeSale\nSearch\nSearch\nHM.com/Customer Service\nCareer at H&M\nShopping at H&M\nShopping Online\nShopping in stores\nStore Locator\nDelivery\nPayments\nReturns\nGift Cards\nGift Cards\nCheck Your Balance\nTerms & Conditions\nSizeguide\nSizing\nProduct & Size\nGarment Collecting & Recycling\nProduct Information\nQuality\nProduct Care\nRecalled Items\nH&M Membership\nDiscover the Membership\nH&M Membership Terms & Conditions\nLegal & privacy\nPrivacy Notice\nCookie Notice\nTerms & Conditions\nProduct Review Terms & Conditions\nBug Bounty Program\nSecure shopping\nCSR (Corporate Social Responsibility)\nCorporate Social Responsibility (CSR) Policy\nCSR Committee Composition\nCSR Annual Action Plan\nContact\nCorporate Info\nAnnual Return\n \nWelcome to Customer Service\n\nQUICK LINKS\n\nI WANT TO KNOW WHERE MY ORDER IS\n\nEnter the order number found in the order confirmation email\n\nOrder no\nTrack my order\nI WANT TO RETURN SOMETHING\n\nRegister returns easily online. All you need is the order number found in the order confirmation email, and the email address used when placing your order.\n\nThe return request must be raised with us within 15 days from the date you receive your parcel\n\nRegister a return\n\nPOPULAR TOPICS\n\nDELIVERY\nRETURNS\nPAYMENTS\nGIFT CARD\n\nChat with our chatbot 24/7 for answers to frequently asked questions or speak with a live agent if you need more support during our opening hours. Contact us\n\nFor questions regarding your personal data, and instructions on how to access or delete your stored information, please visit our Privacy Notice.\n\n \nShop\nLadies\nMen\nBaby\nKids\nHome\nMagazine\nCorporate Info\nCareer at H&M\nAbout H&M group\nSustainability H&M Group\nPress\nInvestor relations\nCorporate governance\nHelp\nCustomer Service\nMy H&M\nFind a store\nLegal & privacy\nContact\nSecure shopping\nCookie Notice\nCookie Settings\n\nSign up now and be the first to know about exclusive offers, latest fashion news & style tips!\n\nRead more\nInstagramIcon\nTikTokLogo\nSpotifyIcon\nYoutubeIcon\nPinterestIcon\nFacebookIcon\nThe content of this site is copyright-protected and is the property of H & M Hennes & Mauritz AB.\nH&M\nINDIA | Rs."
    }
  ]
}