{
  "links": [
    {
      "url": "https://www.nike.com/in/help/a/shipping-delivery",
      "title": "What Are Nike's Delivery Options? | Nike Help"
    },
    {
      "url": "https://www.nike.com/in/membership/shipping",
      "title": "Free Returns"
    },
    {
      "url": "https://www.nike.com/in/help/a/bank-transaction-fees",
      "title": "Did Nike Charge Me an Additional Fee for My Nike Order?"
    },
    {
      "url": "https://www.nike.com/in/help/a/verify-passport",
      "title": "Does My Nike Order Need to Clear Customs? | Nike Help"
    },
    {
      "url": "https://www.nike.com/in/membership",
      "title": "Nike Membership"
    },
    {
      "url": "https://www.nike.com/in/help/a/india-consumer-care-policy",
      "title": "Nike India Consumer Care Policy | Nike Help"
    },
    {
      "url": "https://www.nike.com/in/help/a/returns-policy-gs",
      "title": "What is Nike's returns policy?"
    },
    {
      "url": "https://www.nike.com/in/jordan",
      "title": "Jordan. Nike IN"
    },
    {
      "url": "https://www.nike.com/in/nike-by-you",
      "title": "Nike By You Custom Shoes. Nike IN"
    },
    {
      "url": "https://www.nike.com/in/t/air-more-uptempo-96-shoes-gDWSHg",
      "title": "Nike Air More Uptempo '96 Men's Shoes"
    },
    {
      "url": "https://www.nike.com/in/orders/details",
      "title": "Guest Order Lookup. Nike IN"
    },
    {
      "url": "https://www.nike.com/in/a/how-to-break-in-running-shoes",
      "title": "How to break in new running shoes"
    },
    {
      "url": "https://www.nike.com/in/t/calm-mules-MPxmrQ",
      "title": "Nike Calm Men's Mules"
    },
    {
      "url": "https://www.nike.com/in/t/vista-sandals-85ddft",
      "title": "Nike Vista Women's Sandals"
    }
  ],
  "page_text": [
    {
      "url": "https://www.nike.com/in/help/a/shipping-delivery",
      "title": "What Are Nike's Delivery Options? | Nike Help",
      "content": "Skip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nGET HELP\nWhat can we help you with?\nWhat Are Nike's Delivery Options?\n\nDuring checkout, we'll provide an estimated delivery date. We offer the following delivery options:\n\nStandard delivery\n\n₹ 1 250.00 for all orders\nGenerally arrives in 4–7 business days\n\nOn the day your order will be delivered, the courier will send you a text message with a one-time password. When the courier arrives with your order, you'll need to provide the password to accept the delivery.\n\nAdditional information\nOrders are processed Monday–Friday, except for national holidays.\nOrders may experience longer processing and delivery times during public holidays.\nOrders can't be delivered to PO boxes, re-shippers or package-forwarding services.\nOrders can't be delivered to addresses outside the country or region where they were placed, but you can shop for Nike products on a number of sites globally.\nStandard delivery times do not apply to Nike By You orders.\nDelivery fees are not refundable unless you receive an incorrect item.\nFAQs\nDoes my order need to go through customs?\nWhat about taxes and duties?\nIs expedited delivery available?\nContact Us\nChat with us\n9:00 - 22:00\n7 days a week\nCall us\n000 800 919 0566\n9:00 - 22:00\n7 days a week\nEmail us\nWe'll reply within five business day\nFind a Store\nWe think you are in United States. Update your location?\nIndia\nUnited States\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/membership/shipping",
      "title": "Free Returns",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nNew Styles On Sale: Up To 40% Off\n\nShop All Our New Markdowns\n\nMove, Shop, Customise & Celebrate With Us\n\nNo matter what you feel like doing today, It’s better as a Member.\n\nJoin Us\n\nFree Returns\n\nWe design our shoes and gear to help you perform at peak level, so if they're not exactly right for you, we've got you covered. Nike.com and Nike App purchases can be returned within 30 days (some exclusions apply) and returns are free for Nike Members.\n\nReturns Policy\nMember Benefits\nMember-Only Products\nExclusive Deals\nFree Running and Training Apps\nNike Events\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/help/a/bank-transaction-fees",
      "title": "Did Nike Charge Me an Additional Fee for My Nike Order?",
      "content": "Skip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nGET HELP\nWhat can we help you with?\nDID NIKE CHARGE ME AN ADDITIONAL FEE FOR MY NIKE ORDER?\n\nBe aware that some banks may consider your Nike purchase an international purchase and charge a small transaction fee according to their policies. Nike doesn't charge this fee or control when your bank will charge it. We'll only charge you for the order total displayed during checkout.\n\nContact Us\nChat with us\n9:00 - 22:00\n7 days a week\nCall us\n000 800 919 0566\n9:00 - 22:00\n7 days a week\nEmail us\nWe'll reply within five business day\nFind a Store\nWe think you are in United States. Update your location?\nIndia\nUnited States\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/help/a/verify-passport",
      "title": "Does My Nike Order Need to Clear Customs? | Nike Help",
      "content": "Skip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nGET HELP\nWhat can we help you with?\nDOES MY NIKE ORDER NEED TO CLEAR CUSTOMS?\n\nSince your Nike order is dispatched from abroad, local customs regulations require verification of your national ID, passport or delivery information to clear and deliver your order. Bear in mind that the address on your documents must match the delivery address for the order or you'll need to provide proof of address in addition to your documents.\n\nWe make clearing your order easy—just enter your Know Your Consumer (KYC) information during checkout.\n\nIf you opt not to enter your information during checkout, your order will be temporarily held. You'll have seven days to provide the required information (we'll send you a few email reminders).\n\nIf we don't receive your information within seven days, or if we're unable to validate the information you provide, we'll automatically cancel the order.\n\nNIKE BY YOU ORDERS\n\nProviding your KYC information works a little differently for orders that include any Nike By You items. In this case, once the custom shoes are ready to be dispatched, the courier for your order will email a secure link so you can confirm your KYC information within 30 days. After you confirm your information, the courier will clear and deliver your order. If we don't receive your information within 30 days, or if we're unable to validate the information you provide, we won't be able to deliver the order and we'll issue you a refund.\n\nFAQs\n\nWhat documents do I need to provide to confirm my KYC information?\nIndian citizens can use one of the documents below for verification:\n\nAadhaar card\nVoter ID\nPassport\n\nWhen uploading a copy of your documents, remember to submit copies of the front and back. If you're using your passport for verification, ensure that it's still valid, as expired passports are not accepted.\n\nPlease be aware that regulations require the address on your documents to match your order's delivery address.\n\nI'm a foreign national living in India—how can I confirm my KYC information?\nA passport can be used to confirm your information. Additionally, customs will require proof of your address: a hotel booking receipt, stay visa, rental agreement, or you may provide proof of living with a relative or friend to confirm your address.\n\nWhat if the address on my documents and the delivery address for the order don't match?\nDuring checkout, select \"Address on ID does not match delivery address\" and then submit your proof of residence. You'll need to provide a document that matches the delivery address.\n\nWhat if I didn't submit the correct documents?\nIn this case, your order will be cancelled and we'll send you an order cancellation email.\n\nFor orders with Nike By You items, the courier may get in touch with you for the correct information if it's within 30 days, or your order may be returned to sender. If your order is returned to sender, you won't get an email cancellation, but we'll refund your payment (if payment was collected).\n\nContact Us\nChat with us\n9:00 - 22:00\n7 days a week\nCall us\n000 800 919 0566\n9:00 - 22:00\n7 days a week\nEmail us\nWe'll reply within five business day\nFind a Store\nWe think you are in United States. Update your location?\nIndia\nUnited States\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/membership",
      "title": "Nike Membership",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nNew Styles On Sale: Up To 40% Off\n\nShop All Our New Markdowns\n\nMove, Shop, Customise & Celebrate With Us\n\nNo matter what you feel like doing today, It’s better as a Member.\n\nJoin Us\n\nNike Membership\nSign Up\nIT'S BETTER AS\nA MEMBER\n\nMove, shop, customise and celebrate with the best of Nike.\n\nLet's go\nMember Benefits\n\nMember Product\n\nYour Exclusive Access\nShop\n\nNike By You\n\nYour Customisation Service\nCustomise\n\nMember Rewards\n\nHow We Say Thank You\nCelebrate\n\nSport & Wellness Apps\n\nMovement Where You Are\nMove\nMembers Also Get\nReceiptless Returns\n\nUse the Nike App to return\nor exchange, receipt-free.\n\nMember Experiences\n\nJoin your community for\nlive, Member-only events.\n\nConnect Through Membership\nNike App\n\nKeep up daily with the best of Nike, personalised for you.\n\nExplore\nNike Run Club\n\nRun with us in the\nNike Run Club App.\n\nExplore\nNike Training Club\n\nMove with the best in the\nNike Training Club App.\n\nExplore\nUnmute\nFrequently Asked Questions\nWhat is Nike Membership?\nAm I a Nike Member?\nIs Nike Membership free?\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy\n\n "
    },
    {
      "url": "https://www.nike.com/in/help/a/india-consumer-care-policy",
      "title": "Nike India Consumer Care Policy | Nike Help",
      "content": "Skip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nGET HELP\nWhat can we help you with?\nCONSUMER CARE STORE CLAIM AND EXCHANGE POLICY\nCLAIMS\n\nIf you think your product has a manufacturing defect, you can submit a product claim for purchases made at Nike stores and authorised Nike retail stores with the following photographs:\n\nA picture of your product and the area you believe to have a manufacturing defect.\n\nThe store receipt or invoice clearly showing the purchase date, purchase location, and purchase amount.\n\nThe product tag on your footwear or apparel (please ensure the product number is clearly visible). For equipment claims, be sure to include a picture of the attached sticker.\n\nAfter a claim is submitted, Nike will then inspect the claim to determine if the condition of the claim product is due to a manufacturing defect or not. Nike’s decision in respect of the claim product shall be final and confidential. If Nike is unable to process the claim on the basis of the information or photographs sent, the same will be communicated to the store and consumer through the same claim thread.\n\nUpon receipt of the authorisation email from Nike for replacement of a product, the consumer should present a hard or soft copy of the email to the original place of purchase. The authorised partner will then allow the consumer to choose a product of the same or lesser purchase value of the original purchase as available at that time in the store.\n\nIn case of unavailability of the same or similar product there shall be no cash refund, but the consumer will be entitled to choose any other Nike product from the available stock that's equal to or lower than the actual price paid. If the replacement value is lower, the differential amount shall not be refunded. If the replacement value is higher than the purchase value, the consumer shall have to pay the differential of the amount.\n\nStores, retailers, and consumers must ensure that the replacement process is completed within 30 calendar days from the date of the authorisation email sent by Nike. After 30 calendar days, the consumer will not be eligible for a replacement from Nike.\n\nCLAIM ELIGIBILITY\n\nClaims past six months from the original purchase date will not be accepted. Claims will also be rejected in the following situations:\n\nAny counterfeit or non-genuine Nike products.\n\nAny product missing its manufacturing tag or product sticker.\n\nAny item deemed to be free of a manufacturing defect or flaw.\n\nAny products that exhibit excessive wear, misuse, alteration, or wear and tear deemed to be normal.\n\nAny products subjected to harsh treatment, such as contact with any sharp, rough, abrasive, or acidic materials that may cause damage, intentional or not.\n\nAny product deemed by Nike to have been damaged by misuse.\n\nAny product purchased from online or store retailers that are not authorised by Nike.\nEXCHANGE ELIGIBILITY\n\nProducts can only be exchanged due to size, fit, or style at the original place of purchase. Nike-authorised retail partners have their own respective return and exchange policies, hence please refer to your invoice or the store’s terms and conditions.\n\nDEFINITIONS AND ELIGIBILITY\n\nBusiness Days\nBusiness days shall mean English calendar days.\n\nConsumer\nA consumer shall mean and include any person, or individual, who has purchased a product from any Nike store or Nike-authorised retail partner.\n\nClaim Procedure\nThe procedure, as outlined herein, to be followed by the consumer to claim a replacement of a Nike product.\n\nDiscount\nSale of products at a discount which shall be offered to a consumer at a Nike factory store or Nike authorised store, physical and online.\n\nManufacturing Defects\nAny and all defects in production pertaining to materials or workmanship. Such defects include issues related to bonding, stitching, material or components failure, cosmetics, and workmanship. This guarantee applies when the product is used under normal conditions and for the purpose for which the product was designed. This does not apply to normal wear and tear or damage related to alteration, accident, misuse, improper care, or negligence.\n\nMaximum Retail Price (MRP), Normal Conditions\nMRP shall mean the maximum retail price at which a Nike product is sold which shall not include the discount offered, if any, on the products.\n\nProducts\nThe Nike products shall be broadly categorized into footwear, apparel, equipment, and any other category which shall stand included into the existing categories by Nike upon introduction of such line of products in the Indian retail market.\nStore\nStores authorised by Nike can be classified into the following three categories listed below in this policy, which shall include the mono-brand store, multi-brand store, and the factory outlet store.\n\nMono-brand Store\nStores exclusively selling Nike-branded products are referred to as the mono-brand stores, and the business shall be conducted by different retail partners across the country appointed by Nike as authorised partners.\n\nMulti-brand Store\nThe stores that cater to multiple brands and shall also be selling Nike products within their stores alongside other branded products.\n\nOnline store purchase\nOnline store purchase shall mean and include a purchase made by a consumer from Nike or Nike authorised online retailer in India that sells Nike product. Authorised online retailers include:\n\nhttp://www.ajio.com\nhttp://www.flipkart.com\nhttp://www.myntra.com\nhttps://www.vegnonveg.com\nhttps://www.superkicks.in/\nhttps://www.nbastore.in/\nhttps://limitededt.in/\n\nWarranty Period\nSix months from the date of purchase of the product shall be treated as a valid period to claim warranty for a product purchased in India.\n\nContact Us\nWe can be reached toll-free for product claim questions at 000 800 919 0566.\n\nContact Us\nCall us\n000 800 919 0566\n9:00 - 22:00\n7 days a week\nWe think you are in United States. Update your location?\nIndia\nUnited States\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/help/a/returns-policy-gs",
      "title": "What is Nike's returns policy?",
      "content": "Skip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nGET HELP\nWhat can we help you with?\nWhat is Nike's returns policy?\n\nNike.com and Nike App purchases can be returned within 30 days (some exceptions apply). To be eligible to return, items must be in their original condition, unworn and unwashed with complete accessories, and the original packaging and tags must also be intact and in their original condition. This policy includes custom Nike By You sneakers.\n\nAnd remember, returns are always free for Nike Members—just make sure you sign in during checkout.\n\nSo go ahead, shop with confidence.\n\nShop NikeStart a ReturnJoin Us\nFAQs\nHow do I return a Nike order?\nCan I exchange a Nike order?\nCan I return items after 30 days?\nHow do I return a defective or faulty product?\nHow do I return a Nike store purchase?\nRelated\nHow do I return my Nike order?\nContact Us\nChat with us\n9:00 - 22:00\n7 days a week\nCall us\n000 800 919 0566\n9:00 - 22:00\n7 days a week\nEmail us\nWe'll reply within five business day\nFind a Store\nWe think you are in United States. Update your location?\nIndia\nUnited States\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/jordan",
      "title": "Jordan. Nike IN",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nNew Styles On Sale: Up To 40% Off\n\nShop All Our New Markdowns\n\nMove, Shop, Customise & Celebrate With Us\n\nNo matter what you feel like doing today, It’s better as a Member.\n\nJoin Us\n\nNew ReleasesJordan SportMenWomenKids\n\nJordan Draft Jacket\n\nFIRST PICK ENERGY\n\nThe hooded zip-up at the top of its class.\n\nShop\nSHOP JORDAN ESSENTIALS\n\nJust In\n\nAir Jordan 4 RM\n\nJordan Basketball Shoes\n\nComplete the Look\n\nHEAT CHECK\nJORDAN WOMEN'S APPAREL\nShop\nAIR JORDAN XXXIX\nShop\nPOPULAR RIGHT NOW\nShop All\nZion 4 PF\nBasketball Shoes\nMRP : ₹ 12 795.00\nZion 4 PF\nBasketball Shoes\nMRP : ₹ 12 795.00\nZion 4\nOlder Kids' Basketball Shoes\nMRP : ₹ 8 295.00\nAir Jordan 4 RM\nMen's Shoes\nMRP : ₹ 12 795.00\nJordan Flight Essentials 85\nMen's Washed T-Shirt\nMRP : ₹ 2 695.00\nAir Jordan Mule\nGolf Shoes\nMRP : ₹ 8 695.00\nAir Jordan 1 Mid\nMen's Shoes\nMRP : ₹ 11 495.00\nAir Jordan 1 Low SE\nMen's Shoes\nMRP : ₹ 11 895.00\nAir Jordan 1 Mid\nWomen's Shoes\nMRP : ₹ 11 495.00\nJordan Spizike Low\nMen's Shoes\nMRP : ₹ 14 995.00\nEXPLORE MORE FROM JORDAN\n\nJordan Basketball\n\nFind The Shoe That Hoops Like You\n\nLearn More\n\nExplore Jordan Basketball\n\nExplore\nJordan Shoes\nAll Jordan Shoes\nNew Jordan Shoes\nJordan Lifestyle\nJordan Basketball\nMen's Jordan Shoes\nWomen's Jordan Shoes\nKids' Jordan Shoes\nJordan Clothing\nAll Jordan Clothing\nTops & T-Shirts\nJackets\nTrousers\nShorts\nJordan Gear\nAll Jordan Accessories\nHats\nSocks\nFeatured\nAll Jordan Products\nNew Releases\nWomen's Jordan\nKids' Jordan\nRussell Westbrook\nSale\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/nike-by-you",
      "title": "Nike By You Custom Shoes. Nike IN",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nNew Styles On Sale: Up To 40% Off\n\nShop All Our New Markdowns\n\nMove, Shop, Customise & Celebrate With Us\n\nNo matter what you feel like doing today, It’s better as a Member.\n\nJoin Us\n\nNike Membership\nSign Up\nUnmute\nSubtitles\n\nNike By You\n\nWhat If You Were a Shoe?\n\nLet's find out! Be just who you are by putting more youness in your\nshoeness with Nike By You, Nike's co-creation service for Members. A\nlittle more of this, a little less of that—just have fun customising a shoe\nthat feels more like you.\n\nShop\nFeatured NBY Styles\nShop\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Phantom Luna 2 Academy By You\nCustom MG High-Top Football Boot\nMRP : ₹ 11 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Women's Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Women's Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Women's Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Women's Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Women's Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Dunk Low Unlocked By You\nCustom Women's Shoes\nMRP : ₹ 14 995.00\nNike By You\n\nMember Product\n\nCustomise\n\nNike Free RN By You\nCustom Men's Road Running Shoes\nMRP : ₹ 10 795.00\nChoose a So-You Shoe\n\nWhether you're remixing a classic into something never seen before or\nsimplifying the latest drop into a totally neutral palette, your customisation\njourney starts with choosing a shoe. Luckily, we're always adding\nnewness so you can find the just-right way to express your style.\n\nStart Customising\nHow to Nike By You\n\nSpinning through all the curated colour palettes and premium material\noptions in the Nike By You builder is an experimentation session in 3D.\nNot sure where to start? We asked Nike designers for their best tips and\ntricks in a series of fun, short videos to help you find that so-you spark.\n\nExplore\nWhat's Your PiD?\n\nLike your shoe signature, your Personal iD is any combo of letters and\nnumbers that rep you. Maybe it's a nickname, a mantra or your computer\npassword (wait, probably not a good idea). It can be almost anything! Pick\nyour PiD, and show the world who this signature shoe belongs to.\n\nCustomise\nExplore More Benefits\n\nSport & Wellness Apps\n\nMovement Where\nYou're At\nMove\n\nMember Product\n\nYour Exclusive Access\nShop\n\nMember Rewards\n\nHow We Say Thank You\nCelebrate\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/t/air-more-uptempo-96-shoes-gDWSHg",
      "title": "Nike Air More Uptempo '96 Men's Shoes",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\n \nNike Air More Uptempo '96\nMen's shoes\n₹ 16 147.00\nMRP : ₹ 16 995.00\nInclusive of all taxes\n(Also includes all applicable duties)\nSold Out:This product is currently unavailable\n\nBold, retro and all about the A-I-R. The Air More Uptempo '96 refreshes an original that has reigned supreme for more than 20 years. With a design inspired by high-flying basketball style and '90s graffiti art, these kicks can't help but turn heads off court. Nike Air technology absorbs impact for cushioning with every step.\n\n\n\nColour Shown: Light Iron Ore/Black/White/Industrial Blue\nStyle: FD5573-001\nCountry/Region of Origin: Vietnam\nView Product Details\nReviews (6)\nProduct Information\nMore Info\n\nThe ® may appear once or twice on the tongue and/or sockliner as a result of a change implemented by Nike. The product you purchase may appear differently in this respect than the one depicted on Nike.com or NikeApp.\n\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/orders/details",
      "title": "Guest Order Lookup. Nike IN",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nView or Manage Your Order\n\nTo check the status of your order, or to start a return, please enter your order number and email address.\n\nOrder Number*\nEmail address*\nSubmit\nAlready a member?\nSign in\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/a/how-to-break-in-running-shoes",
      "title": "How to break in new running shoes",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\nHow to break in new running shoes\nProduct care\n\nIf you're wondering how long it takes to break in your new sneakers and how to do it, you've come to the right place.\n\nLast updated: 10 September 2024\n6 min read\n0:46\nWatch\n\nFinding the perfect pair of running shoes and breaking them in can take quite a bit of time and effort. So, it makes sense that it can feel overwhelming—and perhaps annoying—when the time comes to replace them. The average running shoe generally lasts between 300 and 500 miles, Carol Mack, DPT, CSCS, previously told Nike. And if you notice blisters on your feet or uneven wear patterns on the soles of your sneakers, it isn't a bad idea to trade in your kicks sooner.\n\nOnce you've found a new pair of running shoes, it's time for the challenging part: helping your feet adapt to them. Wondering how to get started? Read on for step-by-step instructions on how to break in new running shoes and expert-backed advice for making the process as seamless—and painless—as possible.\n\n(RELATED: Shop for running shoes like a pro)\n\nWhy it's important to break in running shoes\n\nA break-in period with new running shoes allows the feet and lower legs to adjust to a stiffer-than-usual sneaker slowly and safely. \"New shoes are less flexible than old ones and reduce the range of motion throughout the footstrike\", explains Sean Fortune, a New York City-based USATF Level II running coach. \"These mechanics increase the risk of injury by putting excess stress on the foot and lower leg\".\n\nAccording to Fortune, potential injuries range from mild to severe and include blisters and foot cramps, plantar fasciitis and Achilles tendonitis, which he's experienced from logging too many miles in new running shoes.\n\nAshley Campbell, a lead product line manager at Nike, adds that the break-in period is especially important if you're running in a type of shoe you've never trained in before, such as a racing shoe or a sneaker with less support than what you're used to. \"A new shoe that has an unfamiliar feel to you may slightly change the way you run through stride or footstrike. So, it's important to allow your body to adapt to mitigate soreness or injury\", she says.\n\nShop Nike Running Shoes\nView All\nNike Pegasus Premium\nMen's Road Running Shoes\nMRP : ₹ 19 295.00\nNike Pegasus Premium\nWomen's Road Running Shoes\nMRP : ₹ 19 295.00\nNike Pegasus Premium\nMen's Road Running Shoes\nMRP : ₹ 19 295.00\nNike Vomero 18\nMen's Road Running Shoes\nMRP : ₹ 13 295.00\nNike Vomero 18\nMen's Road Running Shoes\nMRP : ₹ 13 295.00\nNike Vomero 18\nWomen's Road Running Shoes\nMRP : ₹ 13 295.00\nNike Vomero 18\nMen's Road Running Shoes\nMRP : ₹ 13 295.00\nNike Vomero 18\nWomen's Road Running Shoes\nMRP : ₹ 13 295.00\nNike Vomero 18\nWomen's Road Running Shoes\nMRP : ₹ 13 295.00\nNike Vaporfly 4\nMen's Road Racing Shoes\nMRP : ₹ 21 495.00\nHow to break in new running shoes\n\nYou know by now that it's important to break in your new shoes before logging any serious mileage. But how exactly should you go about it—and how long does it take to break in running shoes? According to Bruce Pinker, DPM, a board-certified podiatrist and foot surgeon, new shoes should be sufficiently broken in after about 5 to 10 miles of wear, give or take. \"It's not the same for everyone. The condition of one's feet, as well as the footwear construction, need to be considered\", Pinker says.\n\n\"Nike running sneakers tend to be crafted from softer materials and have a good amount of flexibility, so the break-in period is minimal—as little as two or three runs\", Campbell says. However, it's always best to follow a more formal break-in process, which may vary from person to person. Runners with foot conditions like plantar fasciitis, for example, may need to spend additional time in their shoes before they're sufficiently broken in. While those without any foot concerns who are breaking in shoes with a flexible construction may require less time, Pinker explains.\n\nHere are the steps you should take during the first handful of miles to help your feet start feeling at home in your new kicks:\n\nWear your shoes around the house\n\nGo about your daily routine at home while wearing your new shoes, and gradually increase the time you spend wearing them, Fortune suggests. Start with an hour or two and work your way up to wearing them for longer stretches of time. This slow transition will help you break in your sneakers while keeping the soles clean in case you decide they're not for you and you need to return them.\n\nThis step, which should last about a week, is especially important if you purchase the shoes online without trying them on first. If you develop blisters, feel pain or discomfort, or your foot continuously slips out of the shoe, return them. Nike will issue a refund or store credit for sneakers that don't have major signs of wear.\n\nBend the toe box\n\nOnce you've decided to keep your shoes, Fortune recommends bending the toe box four or five times so the sole becomes creased. This bending softens the material, making it feel less rigid underfoot.\n\nTry some short runs\n\nAfter a week of wearing your sneakers at home, it's time to give them a true test-drive by picking up the pace. Fortune suggests doing a few short, easy runs in your new sneakers (reduce your typical distance by half) and wearing your older sneakers for long runs. Research shows that alternating your old sneakers with your new ones for several weeks can help ward off running-related injuries. Pinker says this is especially true for long-distance runners, while weekend joggers may only need to follow this routine for about a week before they can exclusively work out in their new sneakers.\n\nTransition to your typical routine\n\nSlowly transition to your typical mileage in your new sneakers. \"If your feet or legs begin to hurt, listen to your body, stop running and resume the break-in process\", Pinker says.\n\nWhile this may seem tedious, it's worth it to be patient. Research shows a slow transition can help prevent muscle soreness and injury.\n\nShop Nike running accessories & equipment\nView All\nNike Dri-FIT ADV Fly\nUnstructured AeroBill AeroAdapt Cap\nMRP : ₹ 2 295.00\nNike Apex\nDri-FIT Bucket Hat\nMRP : ₹ 1 995.00\nNike Dri-FIT Apex\nBucket Hat\nMRP : ₹ 1 995.00\nNike Rise\nDri-FIT Trucker Cap\nMRP : ₹ 1 295.00\nNike Dri-FIT ADV Fly\nUnstructured AeroBill AeroAdapt Cap\nMRP : ₹ 2 295.00\nNike Dri-FIT ADV Club\nStructured Swoosh Cap\nMRP : ₹ 1 595.00\nNike Ace\nDri-FIT Visor\nMRP : ₹ 995.00\nNike Spark Lightweight\nRunning Ankle Socks\nMRP : ₹ 895.00\nNike Spark Lightweight\nRunning Ankle Socks\nMRP : ₹ 895.00\nNike\nTrail-Running Crew Socks (1 Pair)\nMRP : ₹ 1 395.00\nAdditional tips and tricks\n\nOverall, breaking in new running shoes should be straightforward and painless. But sometimes, questions come up along the way. These tips and tricks may prove helpful:\n\nPick the right size shoe\n\n\"The fit of a running shoe should not be distracting and should feel like an extension of your foot\", Campbell says. If your shoes cause blisters, pinch your toes or feel too tight in the heel, they might not be the right size or shoe type for you. \"A shoe that's the correct size should have 1cm (approx.) of space between the longest toe and the end of the shoe and should fit snugly width-wise but not feel tight\", Pinker says. If your shoe is too small, return it. It's always better to opt for a larger running shoe if you fall somewhere between sizes.\n\nWear the correct socks\n\nIf your new sneakers feel generally OK, but the fit feels slightly off, consider trying a different pair of socks. \"It's a good idea to try a variety of socks of different thicknesses to see which best fits your foot and running shoe\", Fortune says. \"I have thinner ones for my racing shoes, which fit a little tighter, and thicker socks for my sneakers that fit a little bigger\".\n\nMaterials are also important to consider in addition to sock thickness. Pinker generally recommends socks that are a blend of cotton and polyester or another synthetic like nylon, rayon or Lycra. The cotton provides cushioning while the synthetics wick away moisture from the foot, which can help prevent common foot conditions, such as athlete's foot fungus, toenail fungus and plantar warts, he explains.\n\n(RELATED: How to choose the best socks for running)\n\nShop Nike Running Socks\nView All\nNike Spark Lightweight\nRunning Crew Socks\nMRP : ₹ 895.00\nNike Multiplier\nRunning Ankle Socks (2 Pairs)\nMRP : ₹ 895.00\nNike Multiplier\nRunning No-Show Socks (2 Pairs)\nMRP : ₹ 895.00\nNike\nTrail-Running Ankle Socks (1 Pair)\nMRP : ₹ 1 395.00\nNike Spark Lightweight\nRunning Ankle Socks\nMRP : ₹ 895.00\nNike\nTrail-Running Crew Socks (1 Pair)\nMRP : ₹ 1 395.00\nNike Spark Lightweight\nNo-Show Running Socks\nMRP : ₹ 895.00\n\nWords by Dana Leigh Smith\n\nOriginally published: 20 May 2024\n\nRelated Stories\nProduct care\nHow to lace running shoes\nProduct care\nHow to remove odour from shoes\nProduct news\nNike Pegasus Premium reimagines running on air\nBuying guide\nWaterproof Running Gear for Rainy-Day Runs\nBuying guide\nThe best Nike waterproof running shoes\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/t/calm-mules-MPxmrQ",
      "title": "Nike Calm Men's Mules",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\n \nHighly Rated\nNike Calm\nMen's Mules\nMRP : ₹ 5 695.00\nInclusive of all taxes\n(Also includes all applicable duties)\nSelect Size\nSize Guide\nUK 5.5\nUK 6\nUK 7\nUK 8\nUK 9\nUK 10\nUK 11\nUK 12\nAdd to Bag\nFavourite\n\nEnjoy a calm, comfortable experience—wherever your day off takes you. Made from soft yet supportive foam, the minimal design makes these mules easy to style with or without socks. And the heel strap is both adjustable and removable to give you a personalised fit.\n\n\n\nColour Shown: Volt/Volt/Volt\nStyle: FD5130-700\nCountry/Region of Origin: Indonesia\nView Product Details\nDelivery & Returns\nReviews (82)\nProduct Information\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    },
    {
      "url": "https://www.nike.com/in/t/vista-sandals-85ddft",
      "title": "Nike Vista Women's Sandals",
      "content": "We think you are in United States. Update your location?\nIndia\nUnited States\nSkip to main content\n\nFind a Store\n\nHelp\n\nJoin Us\n\nSign In\n\nNew & Featured\nMen\nWomen\nKids\nSale\nSNKRS\n\n \nNike Vista\nWomen's Sandals\nMRP : ₹ 4 195.00\nInclusive of all taxes\n(Also includes all applicable duties)\nSold Out:This colour is currently unavailable\n\nWith all the elements you need for a day outdoors, these sandals deliver big—without weighing you down. They're light and airy, with a tough tread and responsive cushioning. And thanks to the adjustable strap, you can personalise the fit when you're on the go.\n\n\n\nColour Shown: Pink Oxford/Rose Whisper/Summit White\nStyle: DJ6607-600\nCountry/Region of Origin: Vietnam\nView Product Details\nDelivery & Returns\nReviews (2)\nProduct Information\nResources\n\nFind A Store\n\nBecome A Member\n\nSend Us Feedback\n\nHelp\n\nGet Help\n\nOrder Status\n\nDelivery\n\nReturns\n\nPayment Options\n\nContact Us On Nike.com Inquiries\n\nContact Us On All Other Inquiries\n\nCompany\n\nAbout Nike\n\nNews\n\nCareers\n\nInvestors\n\nSustainability\n\nReport a Concern\n\nIndia\n\n© 2025 Nike, Inc. All rights reserved\n\nGuides\n\nTerms of Sale\n\nTerms of Use\n\nNike Privacy Policy"
    }
  ]
}